[
  {
    "id": "intrusion-set--381fcf73-60f6-4ab2-9991-6af3cbc35192",
    "name": "sandworm-team",
    "aliases": "sandworm-team|electrum|telebots|iron-viking|blackenergy-(group)|quedagh|voodoo-bear|iridium",
    "group_id": "G0034",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 13,
        "items": [
          "bad-rabbit",
          "blackenergy",
          "cyclops-blink",
          "exaramel-for-linux",
          "exaramel-for-windows",
          "greyenergy",
          "industroyer",
          "industroyer2",
          "killdisk",
          "notpetya",
          "olympic-destroyer",
          "p.a.s.-webshell",
          "prestige"
        ]
      },
      "tools": {
        "count": 5,
        "items": [
          "impacket",
          "invoke-psimage",
          "mimikatz",
          "net",
          "psexec"
        ]
      },
      "techniques": {
        "count": 67,
        "items": [
          "T1003.001",
          "T1003.003",
          "T1005",
          "T1018",
          "T1021.002",
          "T1027",
          "T1027.010",
          "T1033",
          "T1036.005",
          "T1040",
          "T1041",
          "T1047",
          "T1049",
          "T1056.001",
          "T1059.001",
          "T1059.005",
          "T1070.004",
          "T1071.001",
          "T1072",
          "T1078",
          "T1078.002",
          "T1082",
          "T1083",
          "T1087.002",
          "T1087.003",
          "T1090",
          "T1102.002",
          "T1105",
          "T1132.001",
          "T1133",
          "T1136.002",
          "T1140",
          "T1195.002",
          "T1199",
          "T1203",
          "T1204.001",
          "T1204.002",
          "T1218.011",
          "T1219",
          "T1485",
          "T1486",
          "T1491.002",
          "T1499",
          "T1505.003",
          "T1555.003",
          "T1561.002",
          "T1566.001",
          "T1566.002",
          "T1570",
          "T1571",
          "T1583.001",
          "T1583.004",
          "T1584.005",
          "T1585.001",
          "T1585.002",
          "T1587.001",
          "T1588.002",
          "T1588.006",
          "T1589.002",
          "T1589.003",
          "T1590.001",
          "T1591.002",
          "T1592.002",
          "T1593",
          "T1594",
          "T1595.002",
          "T1598.003"
        ]
      },
      "tactics": {
        "count": 14,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "exfiltration",
          "impact",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation",
          "reconnaissance",
          "resource-development"
        ]
      },
      "procedures": [
        "T1003.001::[Sandworm Team] has used its plainpwd tool, a modified version of [Mimikatz], and comsvcs.dll to dump Windows credentials from system memory.",
        "T1003.003::[Sandworm Team] has used `ntdsutil.exe` to back up the Active Directory database, likely for credential access.",
        "T1005::[Sandworm Team] has exfiltrated internal documents, files, and other data from compromised hosts.",
        "T1018::[Sandworm Team] has used a tool to query Active Directory using LDAP, discovering information about computers listed in AD.",
        "T1021.002::[Sandworm Team] has copied payloads to the `ADMIN$` share of remote systems and run net use to connect to network shares.",
        "T1027.010::[Sandworm Team] has used ROT13 encoding, AES encryption and compression with the zlib library for their Python-based backdoor.",
        "T1027::[Sandworm Team] has used Base64 encoding within malware variants.",
        "T1033::[Sandworm Team] has collected the username from a compromised host.",
        "T1036.005::[Sandworm Team] has avoided detection by naming a malicious binary explorer.exe.",
        "T1040::[Sandworm Team] has used intercepter-NG to sniff passwords in network traffic.",
        "T1041::[Sandworm Team] has sent system information to its C2 server using HTTP.",
        "T1047::[Sandworm Team] has used [Impacket]’s WMIexec module for remote code execution and VBScript to run WMI queries.",
        "T1049::[Sandworm Team] had gathered user, IP address, and server data related to RDP sessions on a compromised host. It has also accessed network diagram files useful for understanding how a host's network was configured.",
        "T1056.001::[Sandworm Team] has used a keylogger to capture keystrokes by using the SetWindowsHookEx function.",
        "T1059.001::[Sandworm Team] has used PowerShell scripts to run a credential harvesting tool in memory to evade defenses.",
        "T1059.005::[Sandworm Team] has created VBScripts to run an SSH server.",
        "T1070.004::[Sandworm Team] has used backdoors that can delete files used in an attack from an infected system.",
        "T1071.001::[Sandworm Team]'s BCS-server tool connects to the designated C2 server via HTTP.",
        "T1072::[Sandworm Team] has used the commercially available tool RemoteExec for agentless remote code execution.",
        "T1078.002::[Sandworm Team] has used stolen credentials to access administrative accounts within the domain.",
        "T1078::[Sandworm Team] have used previously acquired legitimate credentials prior to attacks.",
        "T1082::[Sandworm Team] used a backdoor to enumerate information about the infected system's operating system.",
        "T1083::[Sandworm Team] has enumerated files on a compromised host.",
        "T1087.002::[Sandworm Team] has used a tool to query Active Directory using LDAP, discovering information about usernames listed in AD.",
        "T1087.003::[Sandworm Team] used malware to enumerate email settings, including usernames and passwords, from the M.E.Doc application.",
        "T1090::[Sandworm Team]'s BCS-server tool can create an internal proxy server to redirect traffic from the adversary-controlled C2 to internal servers which may not be connected to the internet, but are interconnected locally.",
        "T1102.002::[Sandworm Team] has used the Telegram Bot API from Telegram Messenger to send and receive commands to its Python backdoor. [Sandworm Team] also used legitimate M.E.Doc software update check requests for sending and receiving commands and hosted malicious payloads on putdrive.com.",
        "T1105::[Sandworm Team] has pushed additional malicious tools onto an infected system to steal user credentials, move laterally, and destroy data.",
        "T1132.001::[Sandworm Team]'s BCS-server tool uses base64 encoding and HTML tags for the communication traffic between the C2 server.",
        "T1133::[Sandworm Team] has used Dropbear SSH with a hardcoded backdoor password to maintain persistence within the target network. [Sandworm Team] has also used VPN tunnels established in legitimate software company infrastructure to gain access to internal networks of that software company's users.",
        "T1136.002::[Sandworm Team] has created new domain accounts on an ICS access server.",
        "T1140::[Sandworm Team]'s VBS backdoor can decode Base64-encoded data and save it to the %TEMP% folder. The group also decrypted received information using the Triple DES algorithm and decompresses it using GZip.",
        "T1195.002::[Sandworm Team] has distributed [NotPetya] by compromising the legitimate Ukrainian accounting software M.E.Doc and replacing a legitimate software update with a malicious one.",
        "T1199::[Sandworm Team] has used dedicated network connections from one victim organization to gain unauthorized access to a separate organization.",
        "T1203::[Sandworm Team] has exploited vulnerabilities in Microsoft PowerPoint via OLE objects (CVE-2014-4114) and Microsoft Word via crafted TIFF images (CVE-2013-3906).",
        "T1204.001::[Sandworm Team] has tricked unwitting recipients into clicking on malicious hyperlinks within emails crafted to resemble trustworthy senders.",
        "T1204.002::[Sandworm Team] has tricked unwitting recipients into clicking on spearphishing attachments and enabling malicious macros embedded within files.",
        "T1218.011::[Sandworm Team] used a backdoor which could execute a supplied DLL using rundll32.exe.",
        "T1219::[Sandworm Team] has used remote administration tools or remote industrial control system client software for execution and to maliciously release electricity breakers.",
        "T1485::[Sandworm Team] has used the [BlackEnergy] KillDisk component to overwrite files on Windows-based Human-Machine Interfaces.",
        "T1486::[Sandworm Team] has used [Prestige] ransomware to encrypt data at targeted organizations in transportation and related logistics industries in Ukraine and Poland.",
        "T1491.002::[Sandworm Team] defaced approximately 15,000 websites belonging to Georgian government, non-government, and private sector organizations in 2019.",
        "T1499::[Sandworm Team] temporarily disrupted service to Georgian government, non-government, and private sector websites after compromising a Georgian web hosting provider in 2019.",
        "T1505.003::[Sandworm Team] has used webshells including [P.A.S. Webshell] to maintain access to victim networks.",
        "T1555.003::[Sandworm Team]'s CredRaptor tool can collect saved passwords from various internet browsers.",
        "T1561.002::[Sandworm Team] has used the [BlackEnergy] KillDisk component to corrupt the infected system's master boot record.",
        "T1566.001::[Sandworm Team] has delivered malicious Microsoft Office attachments via spearphishing emails.",
        "T1566.002::[Sandworm Team] has crafted phishing emails containing malicious hyperlinks.",
        "T1570::[Sandworm Team] has used `move` to transfer files to a network share and has copied payloads--such as [Prestige] ransomware--to an Active Directory Domain Controller and distributed via the Default Domain Group Policy Object.",
        "T1571::[Sandworm Team] has used port 6789 to accept connections on the group's SSH server.",
        "T1583.001::[Sandworm Team] has registered domain names and created URLs that are often designed to mimic or spoof legitimate websites, such as email login pages, online file sharing and storage websites, and password reset pages.",
        "T1583.004::[Sandworm Team] has leased servers from resellers instead of leasing infrastructure directly from hosting companies to enable its operations.",
        "T1584.005::[Sandworm Team] has used a large-scale botnet to target Small Office/Home Office (SOHO) network devices.",
        "T1585.001::[Sandworm Team] has established social media accounts to disseminate victim internal-only documents and other sensitive data.",
        "T1585.002::[Sandworm Team] has created email accounts that mimic legitimate organizations for its spearphishing operations.",
        "T1587.001::[Sandworm Team] has developed malware for its operations, including malicious mobile applications and destructive malware such as [NotPetya] and [Olympic Destroyer].",
        "T1588.002::[Sandworm Team] has acquired open-source tools for their operations, including [Invoke-PSImage], which was used to establish an encrypted channel from a compromised host to [Sandworm Team]'s C2 server in preparation for the 2018 Winter Olympics attack, as well as [Impacket] and RemoteExec, which were used in their 2022 [Prestige] operations.",
        "T1588.006::In 2017, [Sandworm Team] conducted technical research related to vulnerabilities associated with websites used by the Korean Sport and Olympic Committee, a Korean power company, and a Korean airport.",
        "T1589.002::[Sandworm Team] has obtained valid emails addresses while conducting research against target organizations that were subsequently used in spearphishing campaigns.",
        "T1589.003::[Sandworm Team]'s research of potential victim organizations included the identification and collection of employee information.",
        "T1590.001::[Sandworm Team] conducted technical reconnaissance of the Parliament of Georgia's official internet domain prior to its 2019 attack.",
        "T1591.002::In preparation for its attack against the 2018 Winter Olympics, [Sandworm Team] conducted online research of partner organizations listed on an official PyeongChang Olympics partnership site.",
        "T1592.002::[Sandworm Team] has researched software code to enable supply-chain operations, most notably for the 2017 [NotPetya] attack. [Sandworm Team] also collected a list of computers using specific software as part of its targeting efforts.",
        "T1593::[Sandworm Team] researched Ukraine's unique legal entity identifier (called an \"EDRPOU\" number), including running queries on the EDRPOU website, in preparation for the [NotPetya] attack. [Sandworm Team] has also researched third-party websites to help it craft credible spearphishing emails.",
        "T1594::[Sandworm Team] has conducted research against potential victim websites as part of its operational planning.",
        "T1595.002::[Sandworm Team] has scanned network infrastructure for vulnerabilities as part of its operational planning.",
        "T1598.003::[Sandworm Team] has crafted spearphishing emails with hyperlinks designed to trick unwitting recipients into revealing their account credentials."
      ]
    },
    "description": "[Sandworm Team](https://attack.mitre.org/groups/G0034) is a destructive threat group that has been attributed to Russia's General Staff Main Intelligence Directorate (GRU) Main Center for Special Technologies (GTsST) military unit 74455.(Citation: US District Court Indictment GRU Unit 74455 October 2020)(Citation: UK NCSC Olympic Attacks October 2020) This group has been active since at least 2009.(Citation: iSIGHT Sandworm 2014)(Citation: CrowdStrike VOODOO BEAR)(Citation: USDOJ Sandworm Feb 2020)(Citation: NCSC Sandworm Feb 2020)\n\nIn October 2020, the US indicted six GRU Unit 74455 officers associated with [Sandworm Team](https://attack.mitre.org/groups/G0034) for the following cyber operations: the 2015 and 2016 attacks against Ukrainian electrical companies and government organizations, the 2017 worldwide [NotPetya](https://attack.mitre.org/software/S0368) attack, targeting of the 2017 French presidential campaign, the 2018 [Olympic Destroyer](https://attack.mitre.org/software/S0365) attack against the Winter Olympic Games, the 2018 operation against the Organisation for the Prohibition of Chemical Weapons, and attacks against the country of Georgia in 2018 and 2019.(Citation: US District Court Indictment GRU Unit 74455 October 2020)(Citation: UK NCSC Olympic Attacks October 2020) Some of these were conducted with the assistance of GRU Unit 26165, which is also referred to as [APT28](https://attack.mitre.org/groups/G0007).(Citation: US District Court Indictment GRU Oct 2018)"
  }
]
