[
  {
    "id": "intrusion-set--dd2d9ca6-505b-4860-a604-233685b802c7",
    "name": "wizard-spider",
    "aliases": "wizard-spider|unc1878|temp.mixmaster|grim-spider",
    "group_id": "G0102",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 8,
        "items": [
          "bazar",
          "cobalt-strike",
          "conti",
          "dyre",
          "emotet",
          "grimagent",
          "ryuk",
          "trickbot"
        ]
      },
      "tools": {
        "count": 8,
        "items": [
          "adfind",
          "bloodhound",
          "empire",
          "mimikatz",
          "net",
          "nltest",
          "ping",
          "psexec"
        ]
      },
      "techniques": {
        "count": 46,
        "items": [
          "T1003.002",
          "T1003.003",
          "T1016",
          "T1018",
          "T1021.001",
          "T1021.002",
          "T1021.006",
          "T1027.010",
          "T1033",
          "T1036.004",
          "T1041",
          "T1047",
          "T1048.003",
          "T1053.005",
          "T1055.001",
          "T1059.001",
          "T1059.003",
          "T1070.004",
          "T1071.001",
          "T1074",
          "T1078",
          "T1078.002",
          "T1082",
          "T1087.002",
          "T1112",
          "T1133",
          "T1135",
          "T1204.001",
          "T1204.002",
          "T1210",
          "T1222.001",
          "T1489",
          "T1518.001",
          "T1543.003",
          "T1547.001",
          "T1547.004",
          "T1553.002",
          "T1557.001",
          "T1558.003",
          "T1562.001",
          "T1566.001",
          "T1566.002",
          "T1569.002",
          "T1570",
          "T1588.002",
          "T1588.003"
        ]
      },
      "tactics": {
        "count": 13,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "exfiltration",
          "impact",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation",
          "resource-development"
        ]
      },
      "procedures": [
        "T1003.002::[Wizard Spider] has acquired credentials from the SAM/SECURITY registry hives.",
        "T1003.003::[Wizard Spider] has gained access to credentials via exported copies of the ntds.dit Active Directory database.",
        "T1016::[Wizard Spider] has used \"ipconfig\" to identify the network configuration of a victim machine.",
        "T1018::[Wizard Spider] has used networkdll for network discovery and psfin specifically for financial and point of sale indicators. [Wizard Spider] has also used [AdFind] and nltest/dclist to enumerate domain computers, including the domain controller.",
        "T1021.001::[Wizard Spider] has used RDP for lateral movement.",
        "T1021.002::[Wizard Spider] has used SMB to drop Cobalt Strike Beacon on a domain controller for lateral movement.",
        "T1021.006::[Wizard Spider] has used Window Remote Management to move laterally through a victim network.",
        "T1027.010::[Wizard Spider] used Base64 encoding to obfuscate an [Empire] service and PowerShell commands.",
        "T1033::[Wizard Spider] has used \"whoami\" to identify the local user and their privileges.",
        "T1036.004::[Wizard Spider] has used scheduled tasks to install [TrickBot], using task names to appear legitimate such as WinDotNet, GoogleTask, or Sysnetsf.",
        "T1041::[Wizard Spider] has exfiltrated domain credentials and network enumeration information over command and control (C2) channels.",
        "T1047::[Wizard Spider] has used WMI and LDAP queries for network discovery and to move laterally.",
        "T1048.003::[Wizard Spider] has exfiltrated victim information using FTP.",
        "T1053.005::[Wizard Spider] has used scheduled tasks establish persistence for [TrickBot] and other malware.",
        "T1055.001::[Wizard Spider] has injected malicious DLLs into memory with read, write, and execute permissions.",
        "T1059.001::[Wizard Spider] has used macros to execute PowerShell scripts to download malware on victim's machines.",
        "T1059.003::[Wizard Spider] has used cmd.exe to execute commands on a victim's machine.",
        "T1070.004::[Wizard Spider] has used file deletion to remove some modules and configurations from an infected host after use.",
        "T1071.001::[Wizard Spider] has used HTTP for network communications.",
        "T1074::[Wizard Spider] has collected and staged credentials and network enumeration information, using  the networkdll and psfin [TrickBot] modules.",
        "T1078.002::[Wizard Spider] has used administrative accounts, including Domain Admin, to move laterally within a victim network.",
        "T1078::[Wizard Spider] has used valid credentials for privileged accounts with the goal of accessing domain controllers.",
        "T1082::[Wizard Spider] has used “systeminfo” and similar commands to acquire detailed configuration information of a victim machine.",
        "T1087.002::[Wizard Spider] has identified domain admins through the use of “net group ‘Domain admins’” commands.",
        "T1112::[Wizard Spider] has modified the Registry key HKLM\\System\\CurrentControlSet\\Control\\SecurityProviders\\WDigest by setting the UseLogonCredential registry value to 1 in order to force credentials to be stored in clear text in memory.",
        "T1133::[Wizard Spider] has accessed victim networks by using stolen credentials to access the corporate VPN infrastructure.",
        "T1135::[Wizard Spider] has used the “net view” command to locate mapped network shares.",
        "T1204.001::[Wizard Spider] has lured victims into clicking a malicious link delivered through spearphishing.",
        "T1204.002::[Wizard Spider] has lured victims to execute malware with spearphishing attachments containing macros to download either [Emotet], Bokbot, [TrickBot], or [Bazar].",
        "T1210::[Wizard Spider] has exploited or attempted to exploit Zerologon (CVE-2020-1472) and EternalBlue (MS17-010) vulnerabilities.",
        "T1222.001::[Wizard Spider] has used the icacls command to modify access control to backup servers, providing them with full control of all the system folders.",
        "T1489::[Wizard Spider] has used taskkill.exe and net.exe to stop backup, catalog, cloud, and other services prior to network encryption.",
        "T1518.001::[Wizard Spider] has used WMI to identify anti-virus products installed on a victim's machine.",
        "T1543.003::[Wizard Spider] has installed [TrickBot] as a service named ControlServiceA in order to establish persistence.",
        "T1547.001::[Wizard Spider] has established persistence via the Registry key HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run and a shortcut within the startup folder.",
        "T1547.004::[Wizard Spider] has established persistence using Userinit by adding the Registry key HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon.",
        "T1553.002::[Wizard Spider] has used Digicert code-signing certificates for some of its malware.",
        "T1557.001::[Wizard Spider] has used the Invoke-Inveigh PowerShell cmdlets, likely for name service poisoning.",
        "T1558.003::[Wizard Spider] has used Rubeus, MimiKatz Kerberos module, and the Invoke-Kerberoast cmdlet to steal AES hashes.",
        "T1562.001::[Wizard Spider] has shut down or uninstalled security applications on victim systems that might prevent ransomware from executing.",
        "T1566.001::[Wizard Spider] has used spearphishing attachments to deliver Microsoft documents containing macros or PDFs containing malicious links to download either [Emotet], Bokbot, [TrickBot], or [Bazar].",
        "T1566.002::[Wizard Spider] has sent phishing emails containing a link to an actor-controlled Google Drive document or other free online file hosting services.",
        "T1569.002::[Wizard Spider] has used services.exe to execute scripts and executables during lateral movement within a victim network.",
        "T1570::[Wizard Spider] has used stolen credentials to copy tools into the %TEMP% directory of domain controllers.",
        "T1588.002::[Wizard Spider] has obtained and used publicly-available post-exploitation frameworks and tools like Metasploit, [Empire], [Mimikatz].",
        "T1588.003::[Wizard Spider] obtained a code signing certificate signed by Digicert for some of its malware."
      ]
    },
    "description": "[Wizard Spider](https://attack.mitre.org/groups/G0102) is a Russia-based financially motivated threat group originally known for the creation and deployment of [TrickBot](https://attack.mitre.org/software/S0266) since at least 2016. [Wizard Spider](https://attack.mitre.org/groups/G0102) possesses a diverse arsenal of tools and has conducted ransomware campaigns against a variety of organizations, ranging from major corporations to hospitals.(Citation: CrowdStrike Ryuk January 2019)(Citation: DHS/CISA Ransomware Targeting Healthcare October 2020)(Citation: CrowdStrike Wizard Spider October 2020)"
  }
]
