[
  {
    "id": "intrusion-set--4283ae19-69c7-4347-a35e-b56f08eb660b",
    "name": "zirconium",
    "aliases": "zirconium|apt31",
    "group_id": "G0128",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 0,
        "items": []
      },
      "tools": {
        "count": 0,
        "items": []
      },
      "techniques": {
        "count": 26,
        "items": [
          "T1012",
          "T1016",
          "T1027.002",
          "T1033",
          "T1036",
          "T1036.004",
          "T1041",
          "T1059.003",
          "T1059.006",
          "T1068",
          "T1082",
          "T1102.002",
          "T1105",
          "T1124",
          "T1140",
          "T1204.001",
          "T1218.007",
          "T1547.001",
          "T1555.003",
          "T1566.002",
          "T1567.002",
          "T1573.001",
          "T1583.001",
          "T1583.006",
          "T1598",
          "T1598.003"
        ]
      },
      "tactics": {
        "count": 11,
        "items": [
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "exfiltration",
          "initial-access",
          "persistence",
          "privilege-escalation",
          "reconnaissance",
          "resource-development"
        ]
      },
      "procedures": [
        "T1012::[ZIRCONIUM] has used a tool to query the Registry for proxy settings.",
        "T1016::[ZIRCONIUM] has used a tool to enumerate proxy settings in the target environment.",
        "T1027.002::[ZIRCONIUM] has used multi-stage packers for exploit code.",
        "T1033::[ZIRCONIUM] has used a tool to capture the username on a compromised host in order to register it with C2.",
        "T1036.004::[ZIRCONIUM] has created a run key named Dropbox Update Setup to mask a persistence mechanism for a malicious binary.",
        "T1036::[ZIRCONIUM] has spoofed legitimate applications in phishing lures and changed file extensions to conceal  installation of malware.",
        "T1041::[ZIRCONIUM] has exfiltrated files via the Dropbox API C2.",
        "T1059.003::[ZIRCONIUM] has used a tool to open a Windows Command Shell on a remote host.",
        "T1059.006::[ZIRCONIUM] has used Python-based implants to interact with compromised hosts.",
        "T1068::[ZIRCONIUM] has exploited CVE-2017-0005 for local privilege escalation.",
        "T1082::[ZIRCONIUM] has used a tool to capture the processor architecture of a compromised host in order to register it with C2.",
        "T1102.002::[ZIRCONIUM] has used Dropbox for C2 allowing upload and download of files as well as execution of arbitrary commands.",
        "T1105::[ZIRCONIUM] has used tools to download malicious files to compromised hosts.",
        "T1124::[ZIRCONIUM] has used a tool to capture the time on a compromised host in order to register it with C2.",
        "T1140::[ZIRCONIUM] has used the AES256 algorithm with a SHA1 derived key to decrypt exploit code.",
        "T1204.001::[ZIRCONIUM] has used malicious links in e-mails to lure victims into downloading malware.",
        "T1218.007::[ZIRCONIUM] has used the msiexec.exe command-line utility to download and execute malicious MSI files.",
        "T1547.001::[ZIRCONIUM] has created a Registry Run key named Dropbox Update Setup to establish persistence for a malicious Python binary.",
        "T1555.003::[ZIRCONIUM] has used a tool to steal credentials from installed web browsers including Microsoft Internet Explorer and Google Chrome.",
        "T1566.002::[ZIRCONIUM] has used malicious links in e-mails to deliver malware.",
        "T1567.002::[ZIRCONIUM] has exfiltrated stolen data to Dropbox.",
        "T1573.001::[ZIRCONIUM] has used AES encrypted communications in C2.",
        "T1583.001::[ZIRCONIUM] has purchased domains for use in targeted campaigns.",
        "T1583.006::[ZIRCONIUM] has used GitHub to host malware linked in spearphishing e-mails.",
        "T1598.003::[ZIRCONIUM] has used web beacons in e-mails to track hits to attacker-controlled URL's.",
        "T1598::[ZIRCONIUM] targeted presidential campaign staffers with credential phishing e-mails."
      ]
    },
    "description": "[ZIRCONIUM](https://attack.mitre.org/groups/G0128) is a threat group operating out of China, active since at least 2017, that has targeted individuals associated with the 2020 US presidential election and prominent leaders in the international affairs community.(Citation: Microsoft Targeting Elections September 2020)(Citation: Check Point APT31 February 2021)"
  }
]
