[
  {
    "id": "intrusion-set--899ce53f-13a0-479b-a0e4-67d46e241542",
    "name": "apt29",
    "aliases": "apt29|iron-ritual|iron-hemlock|noblebaron|dark-halo|stellarparticle|nobelium|unc2452|yttrium|the-dukes|cozy-bear|cozyduke|solarstorm|blue-kitsune",
    "group_id": "G0016",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 32,
        "items": [
          "boombox",
          "cloudduke",
          "cobalt-strike",
          "cosmicduke",
          "cozycar",
          "envyscout",
          "fatduke",
          "foggyweb",
          "geminiduke",
          "goldfinder",
          "goldmax",
          "hammertoss",
          "liteduke",
          "miniduke",
          "nativezone",
          "onionduke",
          "pinchduke",
          "polyglotduke",
          "poshspy",
          "powerduke",
          "raindrop",
          "regduke",
          "seaduke",
          "sibot",
          "sorefang",
          "sunburst",
          "sunspot",
          "teardrop",
          "trailblazer",
          "vaporrage",
          "wellmail",
          "wellmess"
        ]
      },
      "tools": {
        "count": 14,
        "items": [
          "aadinternals",
          "adfind",
          "bloodhound",
          "ipconfig",
          "meek",
          "mimikatz",
          "net",
          "psexec",
          "roadtools",
          "sdelete",
          "sliver",
          "systeminfo",
          "tasklist",
          "tor"
        ]
      },
      "techniques": {
        "count": 54,
        "items": [
          "T1021.007",
          "T1027.001",
          "T1027.002",
          "T1027.006",
          "T1036.005",
          "T1047",
          "T1053.005",
          "T1059.001",
          "T1059.006",
          "T1059.009",
          "T1068",
          "T1070.004",
          "T1078",
          "T1078.004",
          "T1087.004",
          "T1090.003",
          "T1090.004",
          "T1098.002",
          "T1098.005",
          "T1105",
          "T1110.001",
          "T1110.003",
          "T1114.002",
          "T1133",
          "T1136.003",
          "T1190",
          "T1199",
          "T1203",
          "T1204.001",
          "T1204.002",
          "T1218.005",
          "T1505.003",
          "T1546.003",
          "T1546.008",
          "T1547.001",
          "T1548.002",
          "T1550.003",
          "T1553.005",
          "T1556.007",
          "T1562.001",
          "T1566.001",
          "T1566.002",
          "T1566.003",
          "T1573",
          "T1583.006",
          "T1586.002",
          "T1586.003",
          "T1587.001",
          "T1587.003",
          "T1588.002",
          "T1595.002",
          "T1621",
          "T1649",
          "T1651"
        ]
      },
      "tactics": {
        "count": 12,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation",
          "reconnaissance",
          "resource-development"
        ]
      },
      "procedures": [
        "T1021.007::[APT29] has leveraged compromised high-privileged on-premises accounts synced to Office 365 to move laterally into a cloud environment, including through the use of Azure AD PowerShell.",
        "T1027.001::[APT29] used large size files to avoid detection by security solutions with hardcoded size limits.",
        "T1027.002::[APT29] used UPX to pack files.",
        "T1027.006::[APT29] has embedded an ISO file within an HTML attachment that contained JavaScript code to initiate malware execution.",
        "T1036.005::[APT29] has renamed malicious DLLs with legitimate names to appear benign; they have also created an Azure AD certificate with a Common Name that matched the display name of the compromised service principal.",
        "T1047::[APT29] used WMI to steal credentials and execute backdoors at a future time.",
        "T1053.005::[APT29] has used named and hijacked scheduled tasks to establish persistence.",
        "T1059.001::[APT29] has used encoded PowerShell scripts uploaded to [CozyCar] installations to download and install [SeaDuke].",
        "T1059.006::[APT29] has developed malware variants written in Python.",
        "T1059.009::[APT29] has leveraged the Microsoft Graph API to perform various actions across Azure and M365 environments. They have also utilized AADInternals PowerShell Modules to access the API",
        "T1068::[APT29] has exploited CVE-2021-36934 to escalate privileges on a compromised host.",
        "T1070.004::[APT29] has used [SDelete] to remove artifacts from victim networks.",
        "T1078.004::[APT29] has gained access to a global administrator account in Azure AD.",
        "T1078::[APT29] has used a compromised account to access an organization's VPN infrastructure.",
        "T1087.004::[APT29] has conducted enumeration of Azure AD accounts.",
        "T1090.003::A backdoor used by [APT29] created a [Tor] hidden service to forward traffic from the [Tor] client to local ports 3389 (RDP), 139 (Netbios), and 445 (SMB) enabling full remote access from outside the network and has also used TOR.",
        "T1090.004::[APT29] has used the meek domain fronting plugin for [Tor] to hide the destination of C2 traffic.",
        "T1098.002::[APT29] has used a compromised global administrator account in Azure AD to backdoor a service principal with `ApplicationImpersonation` rights to start collecting emails from targeted mailboxes.",
        "T1098.005::[APT29] has enrolled a device in MFA to an Azure AD environment following a successful password guessing attack against a dormant account.",
        "T1105::[APT29] has downloaded additional tools and malware onto compromised networks.",
        "T1110.001::[APT29] has successfully conducted password guessing attacks against a list of mailboxes.",
        "T1110.003::[APT29] has conducted brute force password spray attacks.",
        "T1114.002::[APT29] has collected emails from targeted mailboxes within a compromised Azure AD tenant.",
        "T1133::[APT29] has used compromised identities to access networks via VPNs and Citrix.",
        "T1136.003::[APT29] can create new users through Azure AD.",
        "T1190::[APT29] has exploited CVE-2019-19781 for Citrix, CVE-2019-11510 for Pulse Secure VPNs, CVE-2018-13379 for FortiGate VPNs, and CVE-2019-9670 in Zimbra software to gain access.",
        "T1199::[APT29] has compromised IT, cloud services, and managed services providers to gain broad access to multiple customers for subsequent operations.",
        "T1203::[APT29] has used multiple software exploits for common client software, like Microsoft Word, Exchange, and Adobe Reader, to gain code execution.",
        "T1204.001::[APT29] has used various forms of spearphishing attempting to get a user to click on a malicous link.",
        "T1204.002::[APT29] has used various forms of spearphishing attempting to get a user to open attachments, including, but not limited to, malicious Microsoft Word documents, .pdf, and .lnk files.",
        "T1218.005::[APT29] has use `mshta` to execute malicious scripts on a compromised host.",
        "T1505.003::[APT29] has installed web shells on exploited Microsoft Exchange servers.",
        "T1546.003::[APT29] has used WMI event subscriptions for persistence.",
        "T1546.008::[APT29] used sticky-keys to obtain unauthenticated, privileged console access.",
        "T1547.001::[APT29] added Registry Run keys to establish persistence.",
        "T1548.002::[APT29] has bypassed UAC.",
        "T1550.003::[APT29] used Kerberos ticket attacks for lateral movement.",
        "T1553.005::[APT29] has embedded ISO images and VHDX files in HTML to evade Mark-of-the-Web.",
        "T1556.007::[APT29] has edited the `Microsoft.IdentityServer.Servicehost.exe.config` file to load a malicious DLL into the AD FS process, thereby enabling persistent access to any service federated with AD FS for a user with a specified User Principal Name.",
        "T1562.001::[APT29] has disabled Purview Audit on targeted accounts prior to stealing emails from  Microsoft 365 tenants.",
        "T1566.001::[APT29] has used spearphishing emails with an attachment to deliver files with exploits to initial victims.",
        "T1566.002::[APT29] has used spearphishing with a link to trick victims into clicking on a link to a zip file containing malicious files.",
        "T1566.003::[APT29] has used the legitimate mailing service Constant Contact to send phishing e-mails.",
        "T1573::[APT29] has used multiple layers of encryption within malware to protect C2 communication.",
        "T1583.006::[APT29] has registered algorithmically generated Twitter handles that are used for C2 by malware, such as [HAMMERTOSS]. [APT29] has also used legitimate web services such as Dropbox and Constant Contact in their operations.",
        "T1586.002::[APT29] has compromised email accounts to further enable phishing campaigns and taken control of dormant accounts.",
        "T1586.003::[APT29] has used residential proxies, including Azure Virtual Machines, to obfuscate their access to victim environments.",
        "T1587.001::[APT29] has used unique malware in many of their operations.",
        "T1587.003::[APT29] has created self-signed digital certificates to enable mutual TLS authentication for malware.",
        "T1588.002::[APT29] has obtained and used a variety of tools including [Mimikatz], [SDelete], [Tor], [meek], and [Cobalt Strike].",
        "T1595.002::[APT29] has conducted widespread scanning of target environments to identify vulnerabilities for exploit.",
        "T1621::[APT29] has used repeated MFA requests to gain access to victim accounts.",
        "T1649::[APT29] has abused misconfigured AD CS certificate templates to impersonate admin users and create additional authentication certificates.",
        "T1651::[APT29] has used Azure Run Command and Azure Admin-on-Behalf-of (AOBO) to execute code on virtual machines."
      ]
    },
    "description": "[APT29](https://attack.mitre.org/groups/G0016) is threat group that has been attributed to Russia's Foreign Intelligence Service (SVR).(Citation: White House Imposing Costs RU Gov April 2021)(Citation: UK Gov Malign RIS Activity April 2021) They have operated since at least 2008, often targeting government networks in Europe and NATO member countries, research institutes, and think tanks. [APT29](https://attack.mitre.org/groups/G0016) reportedly compromised the Democratic National Committee starting in the summer of 2015.(Citation: F-Secure The Dukes)(Citation: GRIZZLY STEPPE JAR)(Citation: Crowdstrike DNC June 2016)(Citation: UK Gov UK Exposes Russia SolarWinds April 2021)\n\nIn April 2021, the US and UK governments attributed the [SolarWinds Compromise](https://attack.mitre.org/campaigns/C0024) to the SVR; public statements included citations to [APT29](https://attack.mitre.org/groups/G0016), Cozy Bear, and The Dukes.(Citation: NSA Joint Advisory SVR SolarWinds April 2021)(Citation: UK NSCS Russia SolarWinds April 2021) Industry reporting also referred to the actors involved in this campaign as UNC2452, NOBELIUM, StellarParticle, Dark Halo, and SolarStorm.(Citation: FireEye SUNBURST Backdoor December 2020)(Citation: MSTIC NOBELIUM Mar 2021)(Citation: CrowdStrike SUNSPOT Implant January 2021)(Citation: Volexity SolarWinds)(Citation: Cybersecurity Advisory SVR TTP May 2021)(Citation: Unit 42 SolarStorm December 2020)"
  },
  {
    "id": "intrusion-set--dc5e2999-ca1a-47d4-8d12-a6984b138a1b",
    "name": "unc2452",
    "aliases": "",
    "group_id": "G0118",
    "is_revoked": true,
    "profile": {
      "malware": {
        "count": 0,
        "items": []
      },
      "tools": {
        "count": 0,
        "items": []
      },
      "techniques": {
        "count": 0,
        "items": []
      },
      "tactics": {
        "count": 0,
        "items": []
      },
      "procedures": []
    },
    "description": "[UNC2452](https://attack.mitre.org/groups/G0118) is a suspected Russian state-sponsored threat group responsible for the 2020 SolarWinds software supply chain intrusion.(Citation: FireEye SUNBURST Backdoor December 2020) Victims of this campaign include government, consulting, technology, telecom, and other organizations in North America, Europe, Asia, and the Middle East.(Citation: FireEye SUNBURST Backdoor December 2020) The group also compromised at least one think tank by late 2019.(Citation: Volexity SolarWinds)"
  }
]
