[
  {
    "id": "tool--13cd9151-83b7-410d-9f98-25d0f0d1d80d",
    "name": "powersploit",
    "aliases": "none",
    "platforms": "windows",
    "tool_id": "S0194",
    "is_revoked": false,
    "profile": {
      "tactics": {
        "count": 7,
        "items": [
          "collection",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "persistence",
          "privilege-escalation"
        ]
      },
      "techniques": {
        "count": 28,
        "items": [
          "T1003.001",
          "T1005",
          "T1012",
          "T1027.005",
          "T1027.010",
          "T1047",
          "T1053.005",
          "T1055.001",
          "T1056.001",
          "T1057",
          "T1059.001",
          "T1087.001",
          "T1113",
          "T1123",
          "T1134",
          "T1482",
          "T1543.003",
          "T1547.001",
          "T1547.005",
          "T1552.002",
          "T1552.006",
          "T1555.004",
          "T1558.003",
          "T1574.001",
          "T1574.007",
          "T1574.008",
          "T1574.009",
          "T1620"
        ]
      },
      "adversaries": {
        "count": 9,
        "items": [
          "apt33",
          "apt41",
          "earth-lusca",
          "fin7",
          "leviathan",
          "menupass",
          "muddywater",
          "patchwork",
          "ta505"
        ]
      },
      "procedures": [
        "T1003.001::[PowerSploit] contains a collection of Exfiltration modules that can harvest credentials using [Mimikatz].",
        "T1005::[PowerSploit] contains a collection of Exfiltration modules that can access data from local files, volumes, and processes.",
        "T1012::[PowerSploit] contains a collection of Privesc-PowerUp modules that can query Registry keys for potential opportunities.",
        "T1027.005::[PowerSploit]'s Find-AVSignature AntivirusBypass module can be used to locate single byte anti-virus signatures.",
        "T1027.010::[PowerSploit] contains a collection of ScriptModification modules that compress and encode scripts and payloads.",
        "T1047::[PowerSploit]'s Invoke-WmiCommand CodeExecution module uses WMI to execute and retrieve the output from a [PowerShell] payload.",
        "T1053.005::[PowerSploit]'s New-UserPersistenceOption Persistence argument can be used to establish via a [Scheduled Task/Job].",
        "T1055.001::[PowerSploit] contains a collection of CodeExecution modules that inject code (DLL, shellcode) into a process.",
        "T1056.001::[PowerSploit]'s Get-Keystrokes Exfiltration module can log keystrokes.",
        "T1057::[PowerSploit]'s Get-ProcessTokenPrivilege Privesc-PowerUp module can enumerate privileges for a given process.",
        "T1059.001::[PowerSploit] modules are written in and executed via [PowerShell].",
        "T1087.001::[PowerSploit]'s Get-ProcessTokenGroup Privesc-PowerUp module can enumerate all SIDs associated with its current token.",
        "T1113::[PowerSploit]'s Get-TimedScreenshot Exfiltration module can take screenshots at regular intervals.",
        "T1123::[PowerSploit]'s Get-MicrophoneAudio Exfiltration module can record system microphone audio.",
        "T1134::[PowerSploit]'s Invoke-TokenManipulation Exfiltration module can be used to manipulate tokens.",
        "T1482::[PowerSploit] has modules such as Get-NetDomainTrust and Get-NetForestTrust to enumerate domain and forest trusts.",
        "T1543.003::[PowerSploit] contains a collection of Privesc-PowerUp modules that can discover and replace/modify service binaries, paths, and configs.",
        "T1547.001::[PowerSploit]'s New-UserPersistenceOption Persistence argument can be used to establish via the HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run Registry key.",
        "T1547.005::[PowerSploit]'s Install-SSP Persistence module can be used to establish by installing a SSP DLL.",
        "T1552.002::[PowerSploit] has several modules that search the Windows Registry for stored credentials: Get-UnattendedInstallFile, Get-Webconfig, Get-ApplicationHost, Get-SiteListPassword, Get-CachedGPPPassword, and Get-RegistryAutoLogon.",
        "T1552.006::[PowerSploit] contains a collection of Exfiltration modules that can harvest credentials from Group Policy Preferences.",
        "T1555.004::[PowerSploit] contains a collection of Exfiltration modules that can harvest credentials from Windows vault credential objects.",
        "T1558.003::[PowerSploit]'s Invoke-Kerberoast module can request service tickets and return crackable ticket hashes.",
        "T1574.001::[PowerSploit] contains a collection of Privesc-PowerUp modules that can discover and exploit DLL hijacking opportunities in services and processes.",
        "T1574.007::[PowerSploit] contains a collection of Privesc-PowerUp modules that can discover and exploit path interception opportunities in the PATH environment variable.",
        "T1574.008::[PowerSploit] contains a collection of Privesc-PowerUp modules that can discover and exploit search order hijacking vulnerabilities.",
        "T1574.009::[PowerSploit] contains a collection of Privesc-PowerUp modules that can discover and exploit unquoted path vulnerabilities.",
        "T1620::[PowerSploit] reflectively loads a Windows PE file into a process."
      ]
    },
    "description": "[PowerSploit](https://attack.mitre.org/software/S0194) is an open source, offensive security framework comprised of [PowerShell](https://attack.mitre.org/techniques/T1059/001) modules and scripts that perform a wide range of tasks related to penetration testing such as code execution, persistence, bypassing anti-virus, recon, and exfiltration. (Citation: GitHub PowerSploit May 2012) (Citation: PowerShellMagazine PowerSploit July 2014) (Citation: PowerSploit Documentation)"
  }
]
