[
  {
    "id": "intrusion-set--17862c7d-9e60-48a0-b48e-da4dc4c3f6b0",
    "name": "patchwork",
    "aliases": "patchwork|hangover-group|dropping-elephant|chinastrats|monsoon|operation-hangover",
    "group_id": "G0040",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 6,
        "items": [
          "autoit-backdoor",
          "backconfig",
          "badnews",
          "ndiskmonitor",
          "tinytyphon",
          "unknown-logger"
        ]
      },
      "tools": {
        "count": 2,
        "items": [
          "powersploit",
          "quasarrat"
        ]
      },
      "techniques": {
        "count": 40,
        "items": [
          "T1005",
          "T1021.001",
          "T1027.001",
          "T1027.002",
          "T1027.005",
          "T1027.010",
          "T1033",
          "T1036.005",
          "T1053.005",
          "T1055.012",
          "T1059.001",
          "T1059.003",
          "T1059.005",
          "T1070.004",
          "T1074.001",
          "T1082",
          "T1083",
          "T1102.001",
          "T1105",
          "T1112",
          "T1119",
          "T1132.001",
          "T1189",
          "T1197",
          "T1203",
          "T1204.001",
          "T1204.002",
          "T1518.001",
          "T1547.001",
          "T1548.002",
          "T1553.002",
          "T1555.003",
          "T1559.002",
          "T1560",
          "T1566.001",
          "T1566.002",
          "T1574.002",
          "T1587.002",
          "T1588.002",
          "T1598.003"
        ]
      },
      "tactics": {
        "count": 12,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation",
          "reconnaissance",
          "resource-development"
        ]
      },
      "procedures": [
        "T1005::[Patchwork] collected and exfiltrated files from the infected system.",
        "T1021.001::[Patchwork] attempted to use RDP to move laterally.",
        "T1027.001::[Patchwork] apparently altered [NDiskMonitor] samples by adding four bytes of random letters in a likely attempt to change the file hashes.",
        "T1027.002::A [Patchwork] payload was packed with UPX.",
        "T1027.005::[Patchwork] apparently altered [NDiskMonitor] samples by adding four bytes of random letters in a likely attempt to change the file hashes.",
        "T1027.010::[Patchwork] has obfuscated a script with Crypto Obfuscator.",
        "T1033::[Patchwork] collected the victim username and whether it was running as admin, then sent the information to its C2 server.",
        "T1036.005::[Patchwork] installed its payload in the startup programs folder as \"Baidu Software Update.\" The group also adds its second stage payload to the startup programs as “Net Monitor.\"",
        "T1053.005::A [Patchwork] file stealer can run a TaskScheduler DLL to add persistence.",
        "T1055.012::A [Patchwork] payload uses process hollowing to hide the UAC bypass vulnerability exploitation inside svchost.exe.",
        "T1059.001::[Patchwork] used [PowerSploit] to download payloads, run a reverse shell, and execute malware on the victim's machine.",
        "T1059.003::[Patchwork] ran a reverse shell with Meterpreter.",
        "T1059.005::[Patchwork] used Visual Basic Scripts (VBS) on victim machines.",
        "T1070.004::[Patchwork] removed certain files and replaced them so they could not be retrieved.",
        "T1074.001::[Patchwork] copied all targeted files to a directory called index that was eventually uploaded to the C&C server.",
        "T1082::[Patchwork] collected the victim computer name, OS version, and architecture type and sent the information to its C2 server. [Patchwork] also enumerated all available drives on the victim's machine.",
        "T1083::A [Patchwork] payload has searched all fixed drives on the victim for files matching a specified list of extensions.",
        "T1102.001::[Patchwork] hides base64-encoded and encrypted C2 server locations in comments on legitimate websites.",
        "T1105::[Patchwork] payloads download additional files from the C2 server.",
        "T1112::A [Patchwork] payload deletes Resiliency Registry keys created by Microsoft Office applications in an apparent effort to trick users into thinking there were no issues during application runs.",
        "T1119::[Patchwork] developed a file stealer to search C:\\ and collect files with certain extensions. [Patchwork] also executed a script to enumerate all drives, store them as a list, and upload generated files to the C2 server.",
        "T1132.001::[Patchwork] used Base64 to encode C2 traffic.",
        "T1189::[Patchwork] has used watering holes to deliver files with exploits to initial victims.",
        "T1197::[Patchwork] has used BITS jobs to download malicious payloads.",
        "T1203::[Patchwork] uses malicious documents to deliver remote execution exploits as part of. The group has previously exploited CVE-2017-8570, CVE-2012-1856, CVE-2014-4114, CVE-2017-0199, CVE-2017-11882, and CVE-2015-1641.",
        "T1204.001::[Patchwork] has used spearphishing with links to try to get users to click, download and open malicious files.",
        "T1204.002::[Patchwork] embedded a malicious macro in a Word document and lured the victim to click on an icon to execute the malware.",
        "T1518.001::[Patchwork] scanned the “Program Files” directories for a directory with the string “Total Security” (the installation path of the “360 Total Security” antivirus tool).",
        "T1547.001::[Patchwork] has added the path of its second-stage malware to the startup folder to achieve persistence. One of its file stealers has also persisted by adding a Registry Run key.",
        "T1548.002::[Patchwork] bypassed User Access Control (UAC).",
        "T1553.002::[Patchwork] has signed malware with self-signed certificates from fictitious and spoofed legitimate software companies.",
        "T1555.003::[Patchwork] dumped the login data database from \\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data.",
        "T1559.002::[Patchwork] leveraged the DDE protocol to deliver their malware.",
        "T1560::[Patchwork] encrypted the collected files' path with AES and then encoded them with base64.",
        "T1566.001::[Patchwork] has used spearphishing with an attachment to deliver files with exploits to initial victims.",
        "T1566.002::[Patchwork] has used spearphishing with links to deliver files with exploits to initial victims.",
        "T1574.002::A [Patchwork] .dll that contains [BADNEWS] is loaded and executed using DLL side-loading.",
        "T1587.002::[Patchwork] has created self-signed certificates from fictitious and spoofed legitimate software companies that were later used to sign malware.",
        "T1588.002::[Patchwork] has obtained and used open-source tools such as [QuasarRAT].",
        "T1598.003::[Patchwork] has used embedded image tags (known as web bugs) with unique, per-recipient tracking links in their emails for the purpose of identifying which recipients opened messages."
      ]
    },
    "description": "[Patchwork](https://attack.mitre.org/groups/G0040) is a cyber espionage group that was first observed in December 2015. While the group has not been definitively attributed, circumstantial evidence suggests the group may be a pro-Indian or Indian entity. [Patchwork](https://attack.mitre.org/groups/G0040) has been seen targeting industries related to diplomatic and government agencies. Much of the code used by this group was copied and pasted from online forums. [Patchwork](https://attack.mitre.org/groups/G0040) was also seen operating spearphishing campaigns targeting U.S. think tank groups in March and April of 2018.(Citation: Cymmetria Patchwork) (Citation: Symantec Patchwork)(Citation: TrendMicro Patchwork Dec 2017)(Citation: Volexity Patchwork June 2018)"
  },
  {
    "id": "intrusion-set--9559ecaf-2e75-48a7-aee8-9974020bc772",
    "name": "monsoon",
    "aliases": "",
    "group_id": "G0042",
    "is_revoked": true,
    "profile": {
      "malware": {
        "count": 0,
        "items": []
      },
      "tools": {
        "count": 0,
        "items": []
      },
      "techniques": {
        "count": 0,
        "items": []
      },
      "tactics": {
        "count": 0,
        "items": []
      },
      "procedures": []
    },
    "description": "---"
  }
]
