[
  {
    "id": "tool--3433a9e8-1c47-4320-b9bf-ed449061d1c3",
    "name": "empire",
    "aliases": "none",
    "platforms": "linux|macos|windows",
    "tool_id": "S0363",
    "is_revoked": false,
    "profile": {
      "tactics": {
        "count": 10,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "exfiltration",
          "lateral-movement",
          "persistence",
          "privilege-escalation"
        ]
      },
      "techniques": {
        "count": 72,
        "items": [
          "T1003.001",
          "T1016",
          "T1020",
          "T1021.003",
          "T1021.004",
          "T1027.010",
          "T1033",
          "T1040",
          "T1041",
          "T1046",
          "T1047",
          "T1049",
          "T1053.005",
          "T1055",
          "T1056.001",
          "T1056.004",
          "T1057",
          "T1059",
          "T1059.001",
          "T1059.003",
          "T1068",
          "T1070.006",
          "T1071.001",
          "T1082",
          "T1083",
          "T1087.001",
          "T1087.002",
          "T1102.002",
          "T1105",
          "T1106",
          "T1113",
          "T1114.001",
          "T1115",
          "T1119",
          "T1125",
          "T1127.001",
          "T1134",
          "T1134.002",
          "T1134.005",
          "T1135",
          "T1136.001",
          "T1136.002",
          "T1210",
          "T1217",
          "T1482",
          "T1484.001",
          "T1518.001",
          "T1543.003",
          "T1546.008",
          "T1547.001",
          "T1547.005",
          "T1547.009",
          "T1548.002",
          "T1550.002",
          "T1552.001",
          "T1552.004",
          "T1555.003",
          "T1557.001",
          "T1558.001",
          "T1558.002",
          "T1558.003",
          "T1560",
          "T1567.001",
          "T1567.002",
          "T1569.002",
          "T1573.002",
          "T1574.001",
          "T1574.004",
          "T1574.007",
          "T1574.008",
          "T1574.009",
          "T1615"
        ]
      },
      "adversaries": {
        "count": 14,
        "items": [
          "apt19",
          "apt33",
          "apt41",
          "copykittens",
          "fin10",
          "hexane",
          "indrik-spider",
          "lazyscripter",
          "leviathan",
          "muddywater",
          "silence",
          "turla",
          "wirte",
          "wizard-spider"
        ]
      },
      "procedures": [
        "T1003.001::[Empire] contains an implementation of [Mimikatz] to gather credentials from memory.",
        "T1016::[Empire] can acquire network configuration information like DNS servers, public IP, and network proxies used by a host.",
        "T1020::[Empire] has the ability to automatically send collected data back to the threat actors' C2.",
        "T1021.003::[Empire] can utilize Invoke-DCOM to leverage remote COM execution for lateral movement.",
        "T1021.004::[Empire] contains modules for executing commands over SSH as well as in-memory VNC agent injection.",
        "T1027.010::[Empire] has the ability to obfuscate commands using Invoke-Obfuscation.",
        "T1033::[Empire] can enumerate the username on targeted hosts.",
        "T1040::[Empire] can be used to conduct packet captures on target hosts.",
        "T1041::[Empire] can send data gathered from a target through the command and control channel.",
        "T1046::[Empire] can perform port scans from an infected host.",
        "T1047::[Empire] can use WMI to deliver a payload to a remote host.",
        "T1049::[Empire] can enumerate the current network connections of a host.",
        "T1053.005::[Empire] has modules to interact with the Windows task scheduler.",
        "T1055::[Empire] contains multiple modules for injecting into processes, such as Invoke-PSInject.",
        "T1056.001::[Empire] includes keylogging capabilities for Windows, Linux, and macOS systems.",
        "T1056.004::[Empire] contains some modules that leverage API hooking to carry out tasks, such as netripper.",
        "T1057::[Empire] can find information about processes running on local and remote systems.",
        "T1059.001::[Empire] leverages PowerShell for the majority of its client-side agent tasks. [Empire] also contains the ability to conduct PowerShell remoting with the Invoke-PSRemoting module.",
        "T1059.003::[Empire] has modules for executing scripts.",
        "T1059::[Empire] uses a command-line interface to interact with systems.",
        "T1068::[Empire] can exploit vulnerabilities such as MS16-032 and MS16-135.",
        "T1070.006::[Empire] can timestomp any files or payloads placed on a target machine to help them blend in.",
        "T1071.001::[Empire] can conduct command and control over protocols like HTTP and HTTPS.",
        "T1082::[Empire] can enumerate host system information like OS, architecture, domain name, applied patches, and more.",
        "T1083::[Empire] includes various modules for finding files of interest on hosts and network shares.",
        "T1087.001::[Empire] can acquire local and domain user account information.",
        "T1087.002::[Empire] can acquire local and domain user account information.",
        "T1102.002::[Empire] can use Dropbox and GitHub for C2.",
        "T1105::[Empire] can upload and download to and from a victim machine.",
        "T1106::[Empire] contains a variety of enumeration modules that have an option to use API calls to carry out tasks.",
        "T1113::[Empire] is capable of capturing screenshots on Windows and macOS systems.",
        "T1114.001::[Empire] has the ability to collect emails on a target system.",
        "T1115::[Empire] can harvest clipboard data on both Windows and macOS systems.",
        "T1119::[Empire] can automatically gather the username, domain name, machine name, and other information from a compromised system.",
        "T1125::[Empire] can capture webcam data on Windows and macOS systems.",
        "T1127.001::[Empire] can use built-in modules to abuse trusted utilities like MSBuild.exe.",
        "T1134.002::[Empire] can use Invoke-RunAs to make tokens.",
        "T1134.005::[Empire] can add a SID-History to a user if on a domain controller.",
        "T1134::[Empire] can use [PowerSploit]'s Invoke-TokenManipulation to manipulate access tokens.",
        "T1135::[Empire] can find shared drives on the local system.",
        "T1136.001::[Empire] has a module for creating a local user if permissions allow.",
        "T1136.002::[Empire] has a module for creating a new domain user if permissions allow.",
        "T1210::[Empire] has a limited number of built-in modules for exploiting remote SMB, JBoss, and Jenkins servers.",
        "T1217::[Empire] has the ability to gather browser data such as bookmarks and visited sites.",
        "T1482::[Empire] has modules for enumerating domain trusts.",
        "T1484.001::[Empire] can use New-GPOImmediateTask to modify a GPO that will install and execute a malicious [Scheduled Task/Job].",
        "T1518.001::[Empire] can enumerate antivirus software on the target.",
        "T1543.003::[Empire] can utilize built-in modules to modify service binaries and restore them to their original state.",
        "T1546.008::[Empire] can leverage WMI debugging to remotely replace binaries like sethc.exe, Utilman.exe, and Magnify.exe with cmd.exe.",
        "T1547.001::[Empire] can modify the registry run keys HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run and HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run for persistence.",
        "T1547.005::[Empire] can enumerate Security Support Providers (SSPs) as well as utilize [PowerSploit]'s Install-SSP and Invoke-Mimikatz to install malicious SSPs and log authentication events.",
        "T1547.009::[Empire] can persist by modifying a .LNK file to include a backdoor.",
        "T1548.002::[Empire] includes various modules to attempt to bypass UAC for escalation of privileges.",
        "T1550.002::[Empire] can perform pass the hash attacks.",
        "T1552.001::[Empire] can use various modules to search for files containing passwords.",
        "T1552.004::[Empire] can use modules like Invoke-SessionGopher to extract private key and session information.",
        "T1555.003::[Empire] can use modules that extract passwords from common web browsers such as Firefox and Chrome.",
        "T1557.001::[Empire] can use Inveigh to conduct name service poisoning for credential theft and associated relay attacks.",
        "T1558.001::[Empire] can leverage its implementation of [Mimikatz] to obtain and use golden tickets.",
        "T1558.002::[Empire] can leverage its implementation of [Mimikatz] to obtain and use silver tickets.",
        "T1558.003::[Empire] uses [PowerSploit]'s Invoke-Kerberoast to request service tickets and return crackable ticket hashes.",
        "T1560::[Empire] can ZIP directories on the target system.",
        "T1567.001::[Empire] can use GitHub for data exfiltration.",
        "T1567.002::[Empire] can use Dropbox for data exfiltration.",
        "T1569.002::[Empire] can use [PsExec] to execute a payload on a remote host.",
        "T1573.002::[Empire] can use TLS to encrypt its C2 channel.",
        "T1574.001::[Empire] contains modules that can discover and exploit various DLL hijacking opportunities.",
        "T1574.004::[Empire] has a dylib hijacker module that generates a malicious dylib given the path to a legitimate dylib of a vulnerable application.",
        "T1574.007::[Empire] contains modules that can discover and exploit path interception opportunities in the PATH environment variable.",
        "T1574.008::[Empire] contains modules that can discover and exploit search order hijacking vulnerabilities.",
        "T1574.009::[Empire] contains modules that can discover and exploit unquoted path vulnerabilities.",
        "T1615::[Empire] includes various modules for enumerating Group Policy."
      ]
    },
    "description": "[Empire](https://attack.mitre.org/software/S0363) is an open source, cross-platform remote administration and post-exploitation framework that is publicly available on GitHub. While the tool itself is primarily written in Python, the post-exploitation agents are written in pure [PowerShell](https://attack.mitre.org/techniques/T1059/001) for Windows and Python for Linux/macOS. [Empire](https://attack.mitre.org/software/S0363) was one of five tools singled out by a joint report on public hacking tools being widely used by adversaries.(Citation: NCSC Joint Report Public Tools)(Citation: Github PowerShell Empire)(Citation: GitHub ATTACK Empire)"
  }
]
