[
  {
    "id": "intrusion-set--247cb30b-955f-42eb-97a5-a89fef69341e",
    "name": "apt32",
    "aliases": "apt32|sealotus|oceanlotus|apt-c-00",
    "group_id": "G0050",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 9,
        "items": [
          "cobalt-strike",
          "denis",
          "goopy",
          "kerrdown",
          "komprogo",
          "osx_oceanlotus.d",
          "phoreal",
          "soundbite",
          "windshield"
        ]
      },
      "tools": {
        "count": 5,
        "items": [
          "arp",
          "ipconfig",
          "mimikatz",
          "net",
          "netsh"
        ]
      },
      "techniques": {
        "count": 78,
        "items": [
          "T1003",
          "T1003.001",
          "T1012",
          "T1016",
          "T1018",
          "T1021.002",
          "T1027",
          "T1027.001",
          "T1027.010",
          "T1027.011",
          "T1033",
          "T1036",
          "T1036.003",
          "T1036.004",
          "T1036.005",
          "T1041",
          "T1046",
          "T1047",
          "T1048.003",
          "T1049",
          "T1053.005",
          "T1055",
          "T1056.001",
          "T1059",
          "T1059.001",
          "T1059.003",
          "T1059.005",
          "T1059.007",
          "T1068",
          "T1070.001",
          "T1070.004",
          "T1070.006",
          "T1071.001",
          "T1071.003",
          "T1072",
          "T1078.003",
          "T1082",
          "T1083",
          "T1087.001",
          "T1102",
          "T1105",
          "T1112",
          "T1135",
          "T1137",
          "T1189",
          "T1203",
          "T1204.001",
          "T1204.002",
          "T1216.001",
          "T1218.005",
          "T1218.010",
          "T1218.011",
          "T1222.002",
          "T1505.003",
          "T1543.003",
          "T1547.001",
          "T1550.002",
          "T1550.003",
          "T1552.002",
          "T1560",
          "T1564.001",
          "T1564.003",
          "T1564.004",
          "T1566.001",
          "T1566.002",
          "T1569.002",
          "T1570",
          "T1571",
          "T1574.002",
          "T1583.001",
          "T1583.006",
          "T1585.001",
          "T1588.002",
          "T1589",
          "T1589.002",
          "T1598.003",
          "T1608.001",
          "T1608.004"
        ]
      },
      "tactics": {
        "count": 13,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "exfiltration",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation",
          "reconnaissance",
          "resource-development"
        ]
      },
      "procedures": [
        "T1003.001::[APT32] used Mimikatz and customized versions of Windows Credential Dumper to harvest credentials.",
        "T1003::[APT32] used GetPassword_x64 to harvest credentials.",
        "T1012::[APT32]'s backdoor can query the Windows Registry to gather system information.",
        "T1016::[APT32] used the ipconfig /all command to gather the IP address from the system.",
        "T1018::[APT32] has enumerated DC servers using the command net group \"Domain Controllers\" /domain. The group has also used the ping command.",
        "T1021.002::[APT32] used [Net] to use Windows' hidden network shares to copy their tools to remote machines for execution.",
        "T1027.001::[APT32] includes garbage code to mislead anti-malware software and researchers.",
        "T1027.010::[APT32] has used the `Invoke-Obfuscation` framework to obfuscate their PowerShell.",
        "T1027.011::[APT32]'s backdoor has stored its configuration in a registry key.",
        "T1027::[APT32] has performed code obfuscation, including encoding payloads using Base64 and using a framework called \"Dont-Kill-My-Cat (DKMC). [APT32] also encrypts the library used for network exfiltration with AES-256 in CBC mode in their macOS backdoor.",
        "T1033::[APT32] collected the victim's username and executed the whoami command on the victim's machine. [APT32] executed shellcode to collect the username on the victim's machine.",
        "T1036.003::[APT32] has moved and renamed pubprn.vbs to a .txt file to avoid detection.",
        "T1036.004::[APT32] has used hidden or non-printing characters to help masquerade service names, such as appending a Unicode no-break space character to a legitimate service name. [APT32] has also impersonated the legitimate Flash installer file name \"install_flashplayer.exe\".",
        "T1036.005::[APT32] has renamed a NetCat binary to kb-10233.exe to masquerade as a Windows update. [APT32] has also renamed a Cobalt Strike beacon payload to install_flashplayers.exe.",
        "T1036::[APT32] has disguised a Cobalt Strike beacon as a Flash Installer.",
        "T1041::[APT32]'s backdoor has exfiltrated data using the already opened channel with its C&C server.",
        "T1046::[APT32] performed network scanning on the network to search for open ports, services, OS finger-printing, and other vulnerabilities.",
        "T1047::[APT32] used WMI to deploy their tools on remote machines and to gather information about the Outlook process.",
        "T1048.003::[APT32]'s backdoor can exfiltrate data by encoding it in the subdomain field of DNS packets.",
        "T1049::[APT32] used the netstat -anpo tcp command to display TCP connections on the victim's machine.",
        "T1053.005::[APT32] has used scheduled tasks to persist on victim systems.",
        "T1055::[APT32] malware has injected a Cobalt Strike beacon into Rundll32.exe.",
        "T1056.001::[APT32] has abused the PasswordChangeNotify to monitor for and capture account password changes.",
        "T1059.001::[APT32] has used PowerShell-based tools, PowerShell one-liners, and shellcode loaders for execution.",
        "T1059.003::[APT32] has used cmd.exe for execution.",
        "T1059.005::[APT32] has used macros, COM scriptlets, and VBS scripts.",
        "T1059.007::[APT32] has used JavaScript for drive-by downloads and C2 communications.",
        "T1059::[APT32] has used COM scriptlets to download Cobalt Strike beacons.",
        "T1068::[APT32] has used CVE-2016-7255 to escalate privileges.",
        "T1070.001::[APT32] has cleared select event log entries.",
        "T1070.004::[APT32]'s macOS backdoor can receive a “delete” command.",
        "T1070.006::[APT32] has used scheduled task raw XML with a backdated timestamp of June 2, 2016. The group has also set the creation time of the files dropped by the second stage of the exploit to match the creation time of kernel32.dll. Additionally, [APT32] has used a random value to modify the timestamp of the file storing the clientID.",
        "T1071.001::[APT32] has used JavaScript that communicates over HTTP or HTTPS to attacker controlled domains to download additional frameworks. The group has also used downloaded encrypted payloads over HTTP.",
        "T1071.003::[APT32] has used email for C2 via an Office macro.",
        "T1072::[APT32] compromised McAfee ePO to move laterally by distributing malware as a software deployment task.",
        "T1078.003::[APT32] has used legitimate local admin account credentials.",
        "T1082::[APT32] has collected the OS version and computer name from victims. One of the group's backdoors can also query the Windows Registry to gather system information, and another macOS backdoor performs a fingerprint of the machine on its first connection to the C&C server. [APT32] executed shellcode to identify the name of the infected host.",
        "T1083::[APT32]'s backdoor possesses the capability to list files and directories on a machine.",
        "T1087.001::[APT32] enumerated administrative users using the commands net localgroup administrators.",
        "T1102::[APT32] has used Dropbox, Amazon S3, and Google Drive to host malicious downloads.",
        "T1105::[APT32] has added JavaScript to victim websites to download additional frameworks that profile and compromise website visitors.",
        "T1112::[APT32]'s backdoor has modified the Windows Registry to store the backdoor's configuration.",
        "T1135::[APT32] used the net view command to show all shares available, including the administrative shares such as C$ and ADMIN$.",
        "T1137::[APT32] have replaced Microsoft Outlook's VbaProject.OTM file to install a backdoor macro for persistence.",
        "T1189::[APT32] has infected victims by tricking them into visiting compromised watering hole websites.",
        "T1203::[APT32] has used RTF document that includes an exploit to execute malicious code. (CVE-2017-11882)",
        "T1204.001::[APT32] has lured targets to download a Cobalt Strike beacon by including a malicious link within spearphishing emails.",
        "T1204.002::[APT32] has attempted to lure users to execute a malicious dropper delivered via a spearphishing attachment.",
        "T1216.001::[APT32] has used PubPrn.vbs within execution scripts to execute malware, possibly bypassing defenses.",
        "T1218.005::[APT32] has used mshta.exe for code execution.",
        "T1218.010::[APT32] created a [Scheduled Task/Job] that used regsvr32.exe to execute a COM scriptlet that dynamically downloaded a backdoor and injected it into memory. The group has also used regsvr32 to run their backdoor.",
        "T1218.011::[APT32] malware has used rundll32.exe to execute an initial infection process.",
        "T1222.002::[APT32]'s macOS backdoor changes the permission of the file it wants to execute to 755.",
        "T1505.003::[APT32] has used Web shells to maintain access to victim websites.",
        "T1543.003::[APT32] modified Windows Services to ensure PowerShell scripts were loaded on the system. [APT32] also creates a Windows service to establish persistence.",
        "T1547.001::[APT32] established persistence using Registry Run keys, both to execute PowerShell and VBS scripts as well as to execute their backdoor directly.",
        "T1550.002::[APT32] has used pass the hash for lateral movement.",
        "T1550.003::[APT32] successfully gained remote access by using pass the ticket.",
        "T1552.002::[APT32] used Outlook Credential Dumper to harvest credentials stored in Windows registry.",
        "T1560::[APT32]'s backdoor has used LZMA compression and RC4 encryption before exfiltration.",
        "T1564.001::[APT32]'s macOS backdoor hides the clientID file via a chflags function.",
        "T1564.003::[APT32] has used the WindowStyle parameter to conceal [PowerShell] windows.",
        "T1564.004::[APT32] used NTFS alternate data streams to hide their payloads.",
        "T1566.001::[APT32] has sent spearphishing emails with a malicious executable disguised as a document or spreadsheet.",
        "T1566.002::[APT32] has sent spearphishing emails containing malicious links.",
        "T1569.002::[APT32]'s backdoor has used Windows services as a way to execute its malicious payload.",
        "T1570::[APT32] has deployed tools after moving laterally using administrative accounts.",
        "T1571::An [APT32] backdoor can use HTTP over a non-standard TCP port (e.g 14146) which is specified in the backdoor configuration.",
        "T1574.002::[APT32] ran legitimately-signed executables from Symantec and McAfee which load a malicious DLL. The group also side-loads its backdoor by dropping a library and a legitimate, signed executable (AcroTranscoder).",
        "T1583.001::[APT32] has set up and operated websites to gather information and deliver malware.",
        "T1583.006::[APT32] has set up Dropbox, Amazon S3, and Google Drive to host malicious downloads.",
        "T1585.001::[APT32] has set up Facebook pages in tandem with fake websites.",
        "T1588.002::[APT32] has obtained and used tools such as [Mimikatz] and [Cobalt Strike], and a variety of other open-source tools from GitHub.",
        "T1589.002::[APT32] has collected e-mail addresses for activists and bloggers in order to target them with spyware.",
        "T1589::[APT32] has conducted targeted surveillance against activists and bloggers.",
        "T1598.003::[APT32] has used malicious links to direct users to web pages designed to harvest credentials.",
        "T1608.001::[APT32] has hosted malicious payloads in Dropbox, Amazon S3, and Google Drive for use during targeting.",
        "T1608.004::[APT32] has stood up websites containing numerous articles and content scraped from the Internet to make them appear legitimate, but some of these pages include malicious JavaScript to profile the potential victim or infect them via a fake software update."
      ]
    },
    "description": "[APT32](https://attack.mitre.org/groups/G0050) is a suspected Vietnam-based threat group that has been active since at least 2014. The group has targeted multiple private sector industries as well as foreign governments, dissidents, and journalists with a strong focus on Southeast Asian countries like Vietnam, the Philippines, Laos, and Cambodia. They have extensively used strategic web compromises to compromise victims.(Citation: FireEye APT32 May 2017)(Citation: Volexity OceanLotus Nov 2017)(Citation: ESET OceanLotus)"
  }
]
