[
  {
    "id": "intrusion-set--3753cc21-2dae-4dfb-8481-d004e74502cc",
    "name": "fin7",
    "aliases": "fin7|gold-niagara|itg14|carbon-spider",
    "group_id": "G0046",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 13,
        "items": [
          "boostwrite",
          "carbanak",
          "cobalt-strike",
          "griffon",
          "halfbaked",
          "jss-loader",
          "lizar",
          "pillowmint",
          "powersource",
          "rdfsniffer",
          "revil",
          "sqlrat",
          "textmate"
        ]
      },
      "tools": {
        "count": 4,
        "items": [
          "adfind",
          "crackmapexec",
          "mimikatz",
          "powersploit"
        ]
      },
      "techniques": {
        "count": 40,
        "items": [
          "T1005",
          "T1008",
          "T1021.001",
          "T1021.004",
          "T1021.005",
          "T1027.010",
          "T1036.004",
          "T1036.005",
          "T1047",
          "T1053.005",
          "T1059",
          "T1059.001",
          "T1059.003",
          "T1059.005",
          "T1059.007",
          "T1071.004",
          "T1078",
          "T1091",
          "T1102.002",
          "T1105",
          "T1113",
          "T1125",
          "T1204.001",
          "T1204.002",
          "T1210",
          "T1218.005",
          "T1486",
          "T1497.002",
          "T1543.003",
          "T1546.011",
          "T1547.001",
          "T1553.002",
          "T1558.003",
          "T1559.002",
          "T1566.001",
          "T1566.002",
          "T1567.002",
          "T1571",
          "T1583.001",
          "T1587.001"
        ]
      },
      "tactics": {
        "count": 13,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "exfiltration",
          "impact",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation",
          "resource-development"
        ]
      },
      "procedures": [
        "T1005::[FIN7] has collected files and other sensitive information from a compromised network.",
        "T1008::[FIN7]'s Harpy backdoor malware can use DNS as a backup channel for C2 if HTTP fails.",
        "T1021.001::[FIN7] has used RDP to move laterally in victim environments.",
        "T1021.004::[FIN7] has used SSH to move laterally through victim environments.",
        "T1021.005::[FIN7] has used TightVNC to control compromised hosts.",
        "T1027.010::[FIN7] has used fragmented strings, environment variables, standard input (stdin), and native character-replacement functionalities to obfuscate commands.",
        "T1036.004::[FIN7] has created a scheduled task named “AdobeFlashSync” to establish persistence.",
        "T1036.005::[FIN7] has attempted to run Darkside ransomware with the filename sleep.exe.",
        "T1047::[FIN7] has used WMI to install malware on targeted systems.",
        "T1053.005::[FIN7] malware has created scheduled tasks to establish persistence.",
        "T1059.001::[FIN7] used a PowerShell script to launch shellcode that retrieved an additional payload.",
        "T1059.003::[FIN7] used the command prompt to launch commands on the victim’s machine.",
        "T1059.005::[FIN7] used VBS scripts to help perform tasks on the victim's machine.",
        "T1059.007::[FIN7] used JavaScript scripts to help perform tasks on the victim's machine.",
        "T1059::[FIN7] used SQL scripts to help perform tasks on the victim's machine.",
        "T1071.004::[FIN7] has performed C2 using DNS via A, OPT, and TXT records.",
        "T1078::[FIN7] has harvested valid administrative credentials for lateral movement.",
        "T1091::[FIN7] actors have mailed USB drives to potential victims containing malware that downloads and installs various backdoors, including in some cases for ransomware operations.",
        "T1102.002::[FIN7] used legitimate services like Google Docs, Google Scripts, and Pastebin for C2.",
        "T1105::[FIN7] has downloaded additional malware to execute on the victim's machine, including by using a PowerShell script to launch shellcode that retrieves an additional payload.",
        "T1113::[FIN7] captured screenshots and desktop video recordings.",
        "T1125::[FIN7] created a custom video recording capability that could be used to monitor operations in the victim's environment.",
        "T1204.001::[FIN7] has used malicious links to lure victims into downloading malware.",
        "T1204.002::[FIN7] lured victims to double-click on images in the attachments they sent which would then execute the hidden LNK file.",
        "T1210::[FIN7] has exploited ZeroLogon (CVE-2020-1472) against vulnerable domain controllers.",
        "T1218.005::[FIN7] has used mshta.exe to execute VBScript to execute malicious code on victim systems.",
        "T1486::[FIN7] has encrypted virtual disk volumes on ESXi servers using a version of Darkside ransomware.",
        "T1497.002::[FIN7] used images embedded into document lures that only activate the payload when a user double clicks to avoid sandboxes.",
        "T1543.003::[FIN7] created new Windows services and added them to the startup directories for persistence.",
        "T1546.011::[FIN7] has used application shim databases for persistence.",
        "T1547.001::[FIN7] malware has created Registry Run and RunOnce keys to establish persistence, and has also added items to the Startup folder.",
        "T1553.002::[FIN7] has signed [Carbanak] payloads with legally purchased code signing certificates. [FIN7] has also digitally signed their phishing documents, backdoors and other staging tools to bypass security controls.",
        "T1558.003::[FIN7] has used Kerberoasting for credential access and to enable lateral movement.",
        "T1559.002::[FIN7] spear phishing campaigns have included malicious Word documents with DDE execution.",
        "T1566.001::[FIN7] sent spearphishing emails with either malicious Microsoft Documents or RTF files attached.",
        "T1566.002::[FIN7] has conducted broad phishing campaigns using malicious links.",
        "T1567.002::[FIN7] has exfiltrated stolen data to the MEGA file sharing site.",
        "T1571::[FIN7] has used port-protocol mismatches on ports such as 53, 80, 443, and 8080 during C2.",
        "T1583.001::[FIN7] has registered look-alike domains for use in phishing campaigns.",
        "T1587.001::[FIN7] has developed malware for use in operations, including the creation of infected removable media."
      ]
    },
    "description": "[FIN7](https://attack.mitre.org/groups/G0046) is a financially-motivated threat group that has been active since 2013 primarily targeting the U.S. retail, restaurant, and hospitality sectors, often using point-of-sale malware. A portion of [FIN7](https://attack.mitre.org/groups/G0046) was run out of a front company called Combi Security. Since 2020 [FIN7](https://attack.mitre.org/groups/G0046) shifted operations to a big game hunting (BGH) approach including use of [REvil](https://attack.mitre.org/software/S0496) ransomware and their own Ransomware as a Service (RaaS), Darkside. [FIN7](https://attack.mitre.org/groups/G0046) may be linked to the [Carbanak](https://attack.mitre.org/groups/G0008) Group, but there appears to be several groups using [Carbanak](https://attack.mitre.org/software/S0030) malware and are therefore tracked separately.(Citation: FireEye FIN7 March 2017)(Citation: FireEye FIN7 April 2017)(Citation: FireEye CARBANAK June 2017)(Citation: FireEye FIN7 Aug 2018)(Citation: CrowdStrike Carbon Spider August 2021)"
  }
]
