[
  {
    "id": "intrusion-set--18854f55-ac7c-4634-bd9a-352dd07613b7",
    "name": "apt41",
    "aliases": "apt41|wicked-panda",
    "group_id": "G0096",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 13,
        "items": [
          "aspxspy",
          "blackcoffee",
          "china-chopper",
          "cobalt-strike",
          "derusbi",
          "gh0st-rat",
          "messagetap",
          "njrat",
          "plugx",
          "rockboot",
          "shadowpad",
          "winnti-for-linux",
          "zxshell"
        ]
      },
      "tools": {
        "count": 11,
        "items": [
          "bitsadmin",
          "certutil",
          "empire",
          "ftp",
          "ipconfig",
          "mimikatz",
          "net",
          "netstat",
          "ping",
          "powersploit",
          "pwdump"
        ]
      },
      "techniques": {
        "count": 59,
        "items": [
          "T1003.001",
          "T1005",
          "T1008",
          "T1014",
          "T1016",
          "T1021.001",
          "T1021.002",
          "T1027",
          "T1033",
          "T1036.004",
          "T1036.005",
          "T1046",
          "T1047",
          "T1049",
          "T1053.005",
          "T1055",
          "T1056.001",
          "T1059.001",
          "T1059.003",
          "T1059.004",
          "T1070.001",
          "T1070.003",
          "T1070.004",
          "T1071.001",
          "T1071.002",
          "T1071.004",
          "T1078",
          "T1083",
          "T1090",
          "T1102.001",
          "T1104",
          "T1105",
          "T1110.002",
          "T1112",
          "T1133",
          "T1135",
          "T1136.001",
          "T1190",
          "T1195.002",
          "T1197",
          "T1203",
          "T1218.001",
          "T1218.011",
          "T1480.001",
          "T1486",
          "T1496",
          "T1542.003",
          "T1543.003",
          "T1546.008",
          "T1547.001",
          "T1553.002",
          "T1560.001",
          "T1566.001",
          "T1568.002",
          "T1569.002",
          "T1574.001",
          "T1574.002",
          "T1574.006",
          "T1588.002"
        ]
      },
      "tactics": {
        "count": 12,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "impact",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation",
          "resource-development"
        ]
      },
      "procedures": [
        "T1003.001::[APT41] has used hashdump, [Mimikatz], and the Windows Credential Editor to dump password hashes from memory and authenticate to other user accounts.",
        "T1005::[APT41] has uploaded files and data from a compromised host.",
        "T1008::[APT41] used the Steam community page as a fallback mechanism for C2.",
        "T1014::[APT41] deployed rootkits on Linux systems.",
        "T1016::[APT41] collected MAC addresses from victim machines.",
        "T1021.001::[APT41] used RDP for lateral movement.",
        "T1021.002::[APT41] has transferred implant files using Windows Admin Shares.",
        "T1027::[APT41] used VMProtected binaries in multiple intrusions.",
        "T1033::[APT41] used the WMIEXEC utility to execute whoami commands on remote machines.",
        "T1036.004::[APT41] has created services to appear as benign system tools.",
        "T1036.005::[APT41] attempted to masquerade their files as popular anti-virus software.",
        "T1046::[APT41] used a malware variant called WIDETONE to conduct port scans on specified subnets.",
        "T1047::[APT41] used WMI in several ways, including for execution of commands via WMIEXEC as well as for persistence via [PowerSploit].",
        "T1049::[APT41] has enumerated IP addresses of network resources and used the netstat command as part of network reconnaissance. The group has also used a malware variant, HIGHNOON, to enumerate active RDP sessions.",
        "T1053.005::[APT41] used a compromised account to create a scheduled task on a system.",
        "T1055::[APT41] malware TIDYELF loaded the main WINTERLOVE component by injecting it into the iexplore.exe process.",
        "T1056.001::[APT41] used a keylogger called GEARSHIFT on a target system.",
        "T1059.001::[APT41] leveraged PowerShell to deploy malware families in victims’ environments.",
        "T1059.003::[APT41] used cmd.exe /c to execute commands on remote machines.\n[APT41] used a batch file to install persistence for the [Cobalt Strike] BEACON loader.",
        "T1059.004::[APT41] executed file /bin/pwd in activity exploiting CVE-2019-19781 against Citrix devices.",
        "T1070.001::[APT41] attempted to remove evidence of some of its activity by clearing Windows security and system events.",
        "T1070.003::[APT41] attempted to remove evidence of some of its activity by deleting Bash histories.",
        "T1070.004::[APT41] deleted files from the system.",
        "T1071.001::[APT41] used HTTP to download payloads for CVE-2019-19781 and CVE-2020-10189 exploits.",
        "T1071.002::[APT41] used exploit payloads that initiate download via [ftp].",
        "T1071.004::[APT41] used DNS for C2 communications.",
        "T1078::[APT41] used compromised credentials to log on to other systems.",
        "T1083::[APT41] has executed file /bin/pwd on exploited victims, perhaps to return architecture related information.",
        "T1090::[APT41] used a tool called CLASSFON to covertly proxy network communications.",
        "T1102.001::[APT41] used legitimate websites for C2 through dead drop resolvers (DDR), including GitHub, Pastebin, and Microsoft TechNet.",
        "T1104::[APT41] used the storescyncsvc.dll BEACON backdoor to download a secondary backdoor.",
        "T1105::[APT41] used [certutil] to download additional files.",
        "T1110.002::[APT41] performed password brute-force attacks on the local admin account.",
        "T1112::[APT41] used a malware variant called GOODLUCK to modify the registry in order to steal credentials.",
        "T1133::[APT41] compromised an online billing/payment service using VPN access between a third-party service provider and the targeted payment service.",
        "T1135::[APT41] used the net share command as part of network reconnaissance.",
        "T1136.001::[APT41] created user accounts and adds them to the User and Admin groups.",
        "T1190::[APT41] exploited CVE-2020-10189 against Zoho ManageEngine Desktop Central, and CVE-2019-19781 to compromise Citrix Application Delivery Controllers (ADC) and gateway devices.",
        "T1195.002::[APT41] gained access to production environments where they could inject malicious code into legitimate, signed files and widely distribute them to end users.",
        "T1197::[APT41] used [BITSAdmin] to download and install payloads.",
        "T1203::[APT41] leveraged the follow exploits in their operations: CVE-2012-0158, CVE-2015-1641, CVE-2017-0199, CVE-2017-11882, and CVE-2019-3396.",
        "T1218.001::[APT41] used compiled HTML (.chm) files for targeting.",
        "T1218.011::[APT41] has used rundll32.exe to execute a loader.",
        "T1480.001::[APT41] has encrypted payloads using the Data Protection API (DPAPI), which relies on keys tied to specific user accounts on specific machines. [APT41] has also environmentally keyed second stage malware with an RC5 key derived in part from the infected system's volume serial number.",
        "T1486::[APT41] used a ransomware called Encryptor RaaS to encrypt files on the targeted systems and provide a ransom note to the user.",
        "T1496::[APT41] deployed a Monero cryptocurrency mining tool in a victim’s environment.",
        "T1542.003::[APT41] deployed Master Boot Record bootkits on Windows systems to hide their malware and maintain persistence on victim systems.",
        "T1543.003::[APT41] modified legitimate Windows services to install malware backdoors.",
        "T1546.008::[APT41] leveraged sticky keys to establish persistence.",
        "T1547.001::[APT41] created and modified startup files for persistence.",
        "T1553.002::[APT41] leveraged code-signing certificates to sign malware when targeting both gaming and non-gaming organizations.",
        "T1560.001::[APT41] created a RAR archive of targeted files for exfiltration.",
        "T1566.001::[APT41] sent spearphishing emails with attachments such as compiled HTML (.chm) files to initially compromise their victims.",
        "T1568.002::[APT41] has used DGAs to change their C2 servers monthly.",
        "T1569.002::[APT41] used  svchost.exe and [Net] to execute a system service installed to launch a [Cobalt Strike] BEACON loader.",
        "T1574.001::[APT41] has used search order hijacking to execute malicious payloads, such as Winnti RAT.",
        "T1574.002::[APT41] used legitimate executables to perform DLL side-loading of their malware.",
        "T1574.006::[APT41] has configured payloads to load via LD_PRELOAD.",
        "T1588.002::[APT41] has obtained and used tools such as [Mimikatz], [pwdump], [PowerSploit], and [Windows Credential Editor]."
      ]
    },
    "description": "[APT41](https://attack.mitre.org/groups/G0096) is a threat group that researchers have assessed as Chinese state-sponsored espionage group that also conducts financially-motivated operations. Active since at least 2012, [APT41](https://attack.mitre.org/groups/G0096) has been observed targeting healthcare, telecom, technology, and video game industries in 14 countries. [APT41](https://attack.mitre.org/groups/G0096) overlaps at least partially with public reporting on groups including BARIUM and [Winnti Group](https://attack.mitre.org/groups/G0044).(Citation: FireEye APT41 Aug 2019)(Citation: Group IB APT 41 June 2021)\n"
  }
]
