[
  {
    "id": "intrusion-set--899ce53f-13a0-479b-a0e4-67d46e241542",
    "name": "apt29",
    "aliases": "apt29|iron-ritual|iron-hemlock|noblebaron|dark-halo|stellarparticle|nobelium|unc2452|yttrium|the-dukes|cozy-bear|cozyduke",
    "group_id": "G0016",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 32,
        "items": [
          "boombox",
          "cloudduke",
          "cobalt-strike",
          "cosmicduke",
          "cozycar",
          "envyscout",
          "fatduke",
          "foggyweb",
          "geminiduke",
          "goldfinder",
          "goldmax",
          "hammertoss",
          "liteduke",
          "miniduke",
          "nativezone",
          "onionduke",
          "pinchduke",
          "polyglotduke",
          "poshspy",
          "powerduke",
          "raindrop",
          "regduke",
          "seaduke",
          "sibot",
          "sorefang",
          "sunburst",
          "sunspot",
          "teardrop",
          "trailblazer",
          "vaporrage",
          "wellmail",
          "wellmess"
        ]
      },
      "tools": {
        "count": 14,
        "items": [
          "aadinternals",
          "adfind",
          "bloodhound",
          "ipconfig",
          "meek",
          "mimikatz",
          "net",
          "psexec",
          "roadtools",
          "sdelete",
          "sliver",
          "systeminfo",
          "tasklist",
          "tor"
        ]
      },
      "techniques": {
        "count": 107,
        "items": [
          "T1001.002",
          "T1003.006",
          "T1005",
          "T1016.001",
          "T1018",
          "T1021.001",
          "T1021.002",
          "T1021.006",
          "T1027",
          "T1027.001",
          "T1027.002",
          "T1027.006",
          "T1036",
          "T1036.004",
          "T1036.005",
          "T1047",
          "T1048.002",
          "T1053.005",
          "T1057",
          "T1059.001",
          "T1059.003",
          "T1059.005",
          "T1059.006",
          "T1068",
          "T1069",
          "T1069.002",
          "T1070",
          "T1070.004",
          "T1070.006",
          "T1070.008",
          "T1071.001",
          "T1074.002",
          "T1078",
          "T1078.002",
          "T1078.003",
          "T1078.004",
          "T1082",
          "T1083",
          "T1087",
          "T1087.002",
          "T1087.004",
          "T1090.001",
          "T1090.003",
          "T1090.004",
          "T1095",
          "T1098.001",
          "T1098.002",
          "T1098.003",
          "T1098.005",
          "T1102.002",
          "T1105",
          "T1110.003",
          "T1114.002",
          "T1133",
          "T1136.003",
          "T1140",
          "T1190",
          "T1195.002",
          "T1199",
          "T1203",
          "T1204.001",
          "T1204.002",
          "T1213",
          "T1213.003",
          "T1218.005",
          "T1218.011",
          "T1482",
          "T1484.002",
          "T1505.003",
          "T1539",
          "T1546.003",
          "T1546.008",
          "T1547.001",
          "T1548.002",
          "T1550",
          "T1550.001",
          "T1550.003",
          "T1550.004",
          "T1552.004",
          "T1553.002",
          "T1553.005",
          "T1555",
          "T1555.003",
          "T1556.007",
          "T1558.003",
          "T1560.001",
          "T1562.001",
          "T1562.002",
          "T1562.004",
          "T1566.001",
          "T1566.002",
          "T1566.003",
          "T1568",
          "T1573",
          "T1583.001",
          "T1583.006",
          "T1584.001",
          "T1586.002",
          "T1587.001",
          "T1587.003",
          "T1588.002",
          "T1589.001",
          "T1595.002",
          "T1606.001",
          "T1606.002",
          "T1621",
          "T1649"
        ]
      },
      "tactics": {
        "count": 13,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "exfiltration",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation",
          "reconnaissance",
          "resource-development"
        ]
      },
      "procedures": [
        "T1001.002::[APT29] has used steganography to hide C2 communications in images.",
        "T1003.006::[APT29] leveraged privileged accounts to replicate directory service data with domain controllers.",
        "T1005::[APT29] has extracted files from compromised networks.",
        "T1016.001::[APT29] has used [GoldFinder] to perform HTTP GET requests to check internet connectivity and identify HTTP proxy servers and other redirectors that an HTTP request travels through.",
        "T1018::[APT29] has used [AdFind] to enumerate remote systems.",
        "T1021.001::[APT29] has used RDP sessions from public-facing systems to internal servers.",
        "T1021.002::[APT29] has used administrative accounts to connect over SMB to targeted users.",
        "T1021.006::[APT29] has used WinRM via PowerShell to execute command and payloads on remote hosts.",
        "T1027.001::[APT29] has used large file sizes to avoid detection.",
        "T1027.002::[APT29] used UPX to pack files.",
        "T1027.006::[APT29] has embedded an ISO file within an HTML attachment that contained JavaScript code to initiate malware execution.",
        "T1027::[APT29] has used encoded PowerShell commands.",
        "T1036.004::[APT29] named tasks \\Microsoft\\Windows\\SoftwareProtectionPlatform\\EventCacheManager in order to appear legitimate.",
        "T1036.005::[APT29] renamed software and DLL's with legitimate names to appear benign.",
        "T1036::[APT29] has set the hostnames of its C2 infrastructure to match legitimate hostnames in the victim environment. They have also used IP addresses originating from the same country as the victim for their VPN infrastructure.",
        "T1047::[APT29] used WMI to steal credentials and execute backdoors at a future time.",
        "T1048.002::[APT29] has exfiltrated collected data over a simple HTTPS request to a password-protected archive staged on a victim's OWA servers.",
        "T1053.005::[APT29] used scheduler and schtasks to create new tasks on remote hosts as part of lateral movement.",
        "T1057::[APT29] has used multiple command-line utilities to enumerate running processes.",
        "T1059.001::[APT29] has used encoded PowerShell scripts uploaded to [CozyCar] installations to download and install [SeaDuke]. [APT29] also used PowerShell to create new tasks on remote machines, identify configuration settings, evade defenses, exfiltrate data, and to execute other commands.",
        "T1059.003::[APT29] used cmd.exe to execute commands on remote machines.",
        "T1059.005::[APT29] has written malware variants in Visual Basic.",
        "T1059.006::[APT29] has developed malware variants written in Python.",
        "T1068::[APT29] has exploited CVE-2021-36934 to escalate privileges on a compromised host.",
        "T1069.002::[APT29] has used [AdFind] to enumerate domain groups.",
        "T1069::[APT29] used the Get-ManagementRoleAssignment PowerShell cmdlet to enumerate Exchange management role assignments through an Exchange Management Shell.",
        "T1070.004::[APT29] routinely removed their tools, including custom backdoors, once remote access was achieved. [APT29] has also used [SDelete] to remove artifacts from victims.",
        "T1070.006::[APT29] modified timestamps of backdoors to match legitimate Windows files.",
        "T1070.008::[APT29] removed evidence of email export requests using Remove-MailboxExportRequest.",
        "T1070::[APT29] temporarily replaced legitimate utilities with their own, executed their payload, and then restored the original file.",
        "T1071.001::[APT29] has used HTTP for C2 and data exfiltration.",
        "T1074.002::[APT29] staged data and files in password-protected archives on a victim's OWA server.",
        "T1078.002::[APT29] has used valid accounts, including administrator accounts, to help facilitate lateral movement on compromised networks.",
        "T1078.003::[APT29] has used compromised local accounts to access victims' networks.",
        "T1078.004::[APT29] has used a compromised O365 administrator account to create a new Service Principal.",
        "T1078::[APT29] used different compromised credentials for remote access and to move laterally.",
        "T1082::[APT29] used fsutil to check available free space before executing actions that might create large files on disk.",
        "T1083::[APT29] obtained information about the configured Exchange virtual directory using Get-WebServicesVirtualDirectory.",
        "T1087.002::[APT29] has used PowerShell to discover domain accounts by executing Get-ADUser and Get-ADGroupMember.",
        "T1087.004::[APT29] has conducted enumeration of Azure AD accounts.",
        "T1087::[APT29] obtained a list of users and their roles from an Exchange server using Get-ManagementRoleAssignment.",
        "T1090.001::[APT29] has used SSH port forwarding capabilities on public-facing systems, and configured at least one instance of [Cobalt Strike] to use a network pipe over SMB during the 2020 SolarWinds intrusion.",
        "T1090.003::A backdoor used by [APT29] created a [Tor] hidden service to forward traffic from the [Tor] client to local ports 3389 (RDP), 139 (Netbios), and 445 (SMB) enabling full remote access from outside the network and has also used TOR.",
        "T1090.004::[APT29] has used the meek domain fronting plugin for [Tor] to hide the destination of C2 traffic.",
        "T1095::[APT29] has used TCP for C2 communications.",
        "T1098.001::[APT29] has added credentials to OAuth Applications and Service Principals.",
        "T1098.002::[APT29] added their own devices as allowed IDs for active sync using Set-CASMailbox, allowing it to obtain copies of victim mailboxes. It also added additional permissions (such as Mail.Read and Mail.ReadWrite) to compromised Application or Service Principals.",
        "T1098.003::[APT29] has granted `company administrator` privileges to a newly created service principal.",
        "T1098.005::[APT29] registered devices in order to enable mailbox syncing via the Set-CASMailbox command.",
        "T1102.002::[APT29] has used social media platforms to hide communications to C2 servers.",
        "T1105::[APT29] has downloaded additional tools, such as [TEARDROP] malware and [Cobalt Strike], to a compromised host following initial access.",
        "T1110.003::[APT29] has conducted brute force password spray attacks.",
        "T1114.002::[APT29] collected emails from specific individuals, such as executives and IT staff, using New-MailboxExportRequest followed by Get-MailboxExportRequest.",
        "T1133::[APT29] has used compromised identities to access networks via SSH,  VPNs, and other remote access tools.",
        "T1136.003::[APT29] can create new users through Azure AD.",
        "T1140::[APT29] used 7-Zip to decode its [Raindrop] malware.",
        "T1190::[APT29] has exploited CVE-2019-19781 for Citrix, CVE-2019-11510 for Pulse Secure VPNs, CVE-2018-13379 for FortiGate VPNs, and CVE-2019-9670 in Zimbra software to gain access. They have also exploited CVE-2020-0688 against the Microsoft Exchange Control Panel to regain access to a network.",
        "T1195.002::[APT29] gained initial network access to some victims via a trojanized update of SolarWinds Orion software.",
        "T1199::[APT29] has gained access through compromised accounts at cloud solution partners, and used compromised certificates issued by Mimecast to authenticate to Mimecast customer systems.",
        "T1203::[APT29] has used multiple software exploits for common client software, like Microsoft Word, Exchange, and Adobe Reader, to gain code execution.",
        "T1204.001::[APT29] has used various forms of spearphishing attempting to get a user to click on a malicous link.",
        "T1204.002::[APT29] has used various forms of spearphishing attempting to get a user to open attachments, including, but not limited to, malicious Microsoft Word documents, .pdf, and .lnk files.",
        "T1213.003::[APT29] has downloaded source code from code repositories.",
        "T1213::[APT29] has accessed victims’ internal knowledge repositories (wikis) to view sensitive corporate information on products, services, and internal business operations.",
        "T1218.005::[APT29] has use `mshta` to execute malicious scripts on a compromised host.",
        "T1218.011::[APT29] has used Rundll32.exe to execute payloads.",
        "T1482::[APT29] used the Get-AcceptedDomain PowerShell cmdlet to enumerate accepted domains through an Exchange Management Shell.",
        "T1484.002::[APT29] changed domain federation trust settings using Azure AD administrative permissions to configure the domain to accept authorization tokens signed by their own SAML signing certificate.",
        "T1505.003::[APT29] has installed web shells on exploited Microsoft Exchange servers.",
        "T1539::[APT29] has stolen Chrome browser cookies by copying the Chrome profile directories of targeted users.",
        "T1546.003::[APT29] has used WMI event subscriptions for persistence.",
        "T1546.008::[APT29] used sticky-keys to obtain unauthenticated, privileged console access.",
        "T1547.001::[APT29] added Registry Run keys to establish persistence.",
        "T1548.002::[APT29] has bypassed UAC.",
        "T1550.001::[APT29] has used compromised service principals to make changes to the Office 365 environment.",
        "T1550.003::[APT29] used Kerberos ticket attacks for lateral movement.",
        "T1550.004::[APT29] used stolen cookies to access cloud resources, and a forged duo-sid cookie to bypass MFA set on an email account.",
        "T1550::[APT29] used forged SAML tokens that allowed the actors to impersonate users and bypass MFA, enabling [APT29] to access enterprise cloud applications and services.",
        "T1552.004::[APT29] obtained PKI keys, certificate files and the private encryption key from an Active Directory Federation Services (AD FS) container to decrypt corresponding SAML signing certificates.",
        "T1553.002::[APT29] was able to get [SUNBURST] signed by SolarWinds code signing certificates by injecting the malware into the SolarWinds Orion software lifecycle.",
        "T1553.005::[APT29] has embedded ISO images and VHDX files in HTML to evade Mark-of-the-Web.",
        "T1555.003::[APT29] has stolen user's saved passwords from Chrome.",
        "T1555::[APT29] used account credentials they obtained to attempt access to Group Managed Service Account (gMSA) passwords.",
        "T1556.007::APT29 has edited the `Microsoft.IdentityServer.Servicehost.exe.config` file to load a malicious DLL into the AD FS process, thereby enabling persistent access to any service federated with AD FS for a user with a specified User Principal Name.",
        "T1558.003::[APT29] obtained Ticket Granting Service (TGS) tickets for Active Directory Service Principle Names to crack offline.",
        "T1560.001::[APT29] used 7-Zip to compress stolen emails into password-protected archives prior to exfiltration; [APT29] has also compressed text files into zipped archives.",
        "T1562.001::[APT29] used the service control manager on a remote system to disable services associated with security monitoring products.",
        "T1562.002::[APT29] used AUDITPOL to prevent the collection of audit logs.",
        "T1562.004::[APT29] used netsh to configure firewall rules that limited certain UDP outbound packets.",
        "T1566.001::[APT29] has used spearphishing emails with an attachment to deliver files with exploits to initial victims.",
        "T1566.002::[APT29] has used spearphishing with a link to trick victims into clicking on a link to a zip file containing malicious files.",
        "T1566.003::[APT29] has used the legitimate mailing service Constant Contact to send phishing e-mails.",
        "T1568::[APT29] used dynamic DNS resolution to construct and resolve to randomly-generated subdomains for C2.",
        "T1573::[APT29] has used multiple layers of encryption within malware to protect C2 communication.",
        "T1583.001::[APT29] has acquired C2 domains, sometimes through resellers.",
        "T1583.006::[APT29] has registered algorithmically generated Twitter handles that are used for C2 by malware, such as [HAMMERTOSS]. [APT29] has also used legitimate web services such as Dropbox and Constant Contact in their operations.",
        "T1584.001::[APT29] has compromised domains to use for C2.",
        "T1586.002::[APT29] has compromised email accounts to further enable phishing campaigns.",
        "T1587.001::[APT29] has leveraged numerous pieces of malware that appear to be unique to [APT29] and were likely developed for or by the group.",
        "T1587.003::[APT29] has created self-signed digital certificates to enable mutual TLS authentication for malware.",
        "T1588.002::[APT29] has obtained and used a variety of tools including [Mimikatz], [SDelete], [Tor], [meek], and [Cobalt Strike].",
        "T1589.001::[APT29] has conducted credential theft operations to obtain credentials to be used for access to victim environments.",
        "T1595.002::[APT29] has conducted widespread scanning of target environments to identify vulnerabilities for exploit.",
        "T1606.001::[APT29] has bypassed MFA set on OWA accounts by generating a cookie value from a previously stolen secret key.",
        "T1606.002::[APT29] created tokens using compromised SAML signing certificates.",
        "T1621::[APT29] has used repeated MFA requests to gain access to victim accounts.",
        "T1649::[APT29] has abused misconfigured AD CS certificate templates to impersonate admin users and create additional authentication certificates."
      ]
    },
    "description": "[APT29](https://attack.mitre.org/groups/G0016) is threat group that has been attributed to Russia's Foreign Intelligence Service (SVR).(Citation: White House Imposing Costs RU Gov April 2021)(Citation: UK Gov Malign RIS Activity April 2021) They have operated since at least 2008, often targeting government networks in Europe and NATO member countries, research institutes, and think tanks. [APT29](https://attack.mitre.org/groups/G0016) reportedly compromised the Democratic National Committee starting in the summer of 2015.(Citation: F-Secure The Dukes)(Citation: GRIZZLY STEPPE JAR)(Citation: Crowdstrike DNC June 2016)(Citation: UK Gov UK Exposes Russia SolarWinds April 2021)\n\nIn April 2021, the US and UK governments attributed the SolarWinds supply chain compromise cyber operation to the SVR; public statements included citations to [APT29](https://attack.mitre.org/groups/G0016), Cozy Bear, and The Dukes.(Citation: NSA Joint Advisory SVR SolarWinds April 2021)(Citation: UK NSCS Russia SolarWinds April 2021) Victims of this campaign included government, consulting, technology, telecom, and other organizations in North America, Europe, Asia, and the Middle East. Industry reporting referred to the actors involved in this campaign as UNC2452, NOBELIUM, StellarParticle, and Dark Halo.(Citation: FireEye SUNBURST Backdoor December 2020)(Citation: MSTIC NOBELIUM Mar 2021)(Citation: CrowdStrike SUNSPOT Implant January 2021)(Citation: Volexity SolarWinds)(Citation: Cybersecurity Advisory SVR TTP May 2021)"
  }
]
