[
  {
    "id": "tool--afc079f3-c0ea-4096-b75d-3f05338b7f60",
    "name": "mimikatz",
    "aliases": "none",
    "platforms": "windows",
    "tool_id": "S0002",
    "is_revoked": false,
    "profile": {
      "tactics": {
        "count": 5,
        "items": [
          "credential-access",
          "defense-evasion",
          "lateral-movement",
          "persistence",
          "privilege-escalation"
        ]
      },
      "techniques": {
        "count": 17,
        "items": [
          "T1003.001",
          "T1003.002",
          "T1003.004",
          "T1003.006",
          "T1098",
          "T1134.005",
          "T1207",
          "T1547.005",
          "T1550.002",
          "T1550.003",
          "T1552.004",
          "T1555",
          "T1555.003",
          "T1555.004",
          "T1558.001",
          "T1558.002",
          "T1649"
        ]
      },
      "adversaries": {
        "count": 43,
        "items": [
          "apt1",
          "apt28",
          "apt29",
          "apt32",
          "apt33",
          "apt38",
          "apt39",
          "apt41",
          "backdoordiplomacy",
          "blue-mockingbird",
          "bronze-butler",
          "carbanak",
          "chimera",
          "cleaver",
          "cobalt-group",
          "darkhydrus",
          "dragonfly",
          "earth-lusca",
          "fin6",
          "fin7",
          "gallium",
          "hexane",
          "indrik-spider",
          "ke3chang",
          "kimsuky",
          "lapsus$",
          "leafminer",
          "magic-hound",
          "menupass",
          "muddywater",
          "oilrig",
          "pittytiger",
          "sandworm-team",
          "stolen-pencil",
          "ta505",
          "temp.veles",
          "threat-group-3390",
          "thrip",
          "tonto-team",
          "turla",
          "unc2452",
          "whitefly",
          "wizard-spider"
        ]
      },
      "procedures": [
        "T1003.001::[Mimikatz] performs credential dumping to obtain account and password information useful in gaining access to additional systems and enterprise network resources. It contains functionality to acquire information about credentials in many ways, including from the LSASS Memory.",
        "T1003.002::[Mimikatz] performs credential dumping to obtain account and password information useful in gaining access to additional systems and enterprise network resources. It contains functionality to acquire information about credentials in many ways, including from the SAM table.",
        "T1003.004::[Mimikatz] performs credential dumping to obtain account and password information useful in gaining access to additional systems and enterprise network resources. It contains functionality to acquire information about credentials in many ways, including from the LSA.",
        "T1003.006::[Mimikatz] performs credential dumping to obtain account and password information useful in gaining access to additional systems and enterprise network resources. It contains functionality to acquire information about credentials in many ways, including from DCSync/NetSync.",
        "T1098::The [Mimikatz] credential dumper has been extended to include Skeleton Key domain controller authentication bypass functionality. The LSADUMPChangeNTLM and LSADUMPSetNTLM modules can also manipulate the password hash of an account without knowing the clear text value.",
        "T1134.005::[Mimikatz]'s MISCAddSid module can appended any SID or user/group account to a user's SID-History. [Mimikatz] also utilizes [SID-History Injection] to expand the scope of other components such as generated Kerberos Golden Tickets and DCSync beyond a single domain.",
        "T1207::[Mimikatz]’s LSADUMPDCShadow module can be used to make AD updates by temporarily setting a computer to be a DC.",
        "T1547.005::The [Mimikatz] credential dumper contains an implementation of an SSP.",
        "T1550.002::[Mimikatz]'s SEKURLSAPth module can impersonate a user, with only a password hash, to execute arbitrary commands.",
        "T1550.003::[Mimikatz]’s LSADUMPDCSync and KERBEROSPTT modules implement the three steps required to extract the krbtgt account hash and create/use Kerberos tickets.",
        "T1552.004::[Mimikatz]'s CRYPTOExtract module can extract keys by interacting with Windows cryptographic application programming interface (API) functions.",
        "T1555.003::[Mimikatz] performs credential dumping to obtain account and password information useful in gaining access to additional systems and enterprise network resources. It contains functionality to acquire information about credentials in many ways, including from DPAPI.",
        "T1555.004::[Mimikatz] contains functionality to acquire credentials from the Windows Credential Manager.",
        "T1555::[Mimikatz] performs credential dumping to obtain account and password information useful in gaining access to additional systems and enterprise network resources. It contains functionality to acquire information about credentials in many ways, including from the credential vault and DPAPI.",
        "T1558.001::[Mimikatz]'s kerberos module can create golden tickets.",
        "T1558.002::[Mimikatz]'s kerberos module can create silver tickets.",
        "T1649::[Mimikatz]'s `CRYPTO` module can create and export various types of authentication certificates."
      ]
    },
    "description": "[Mimikatz](https://attack.mitre.org/software/S0002) is a credential dumper capable of obtaining plaintext Windows account logins and passwords, along with many other features that make it useful for testing the security of networks. (Citation: Deply Mimikatz) (Citation: Adsecurity Mimikatz Guide)"
  }
]
