[
  {
    "id": "intrusion-set--93f52415-0fe4-4d3d-896c-fc9b8e88ab90",
    "name": "bronze-butler",
    "aliases": "bronze-butler|redbaldknight|tick",
    "group_id": "G0060",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 7,
        "items": [
          "abk",
          "avenger",
          "bbk",
          "build_downer",
          "daserf",
          "down_new",
          "shadowpad"
        ]
      },
      "tools": {
        "count": 7,
        "items": [
          "at",
          "cmd",
          "gsecdump",
          "mimikatz",
          "net",
          "schtasks",
          "windows-credential-editor"
        ]
      },
      "techniques": {
        "count": 40,
        "items": [
          "T1003.001",
          "T1005",
          "T1007",
          "T1018",
          "T1027.001",
          "T1027.003",
          "T1036",
          "T1036.002",
          "T1036.005",
          "T1039",
          "T1053.002",
          "T1053.005",
          "T1059.001",
          "T1059.003",
          "T1059.005",
          "T1059.006",
          "T1070.004",
          "T1071.001",
          "T1080",
          "T1083",
          "T1087.002",
          "T1102.001",
          "T1105",
          "T1113",
          "T1124",
          "T1132.001",
          "T1140",
          "T1189",
          "T1203",
          "T1204.002",
          "T1518",
          "T1547.001",
          "T1548.002",
          "T1550.003",
          "T1560.001",
          "T1562.001",
          "T1566.001",
          "T1573.001",
          "T1574.002",
          "T1588.002"
        ]
      },
      "tactics": {
        "count": 11,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation",
          "resource-development"
        ]
      },
      "procedures": [
        "T1003.001::[BRONZE BUTLER] has used various tools (such as Mimikatz and WCE) to perform credential dumping.",
        "T1005::[BRONZE BUTLER] has exfiltrated files stolen from local systems.",
        "T1007::[BRONZE BUTLER] has used TROJ_GETVERSION to discover system services.",
        "T1018::[BRONZE BUTLER] typically use ping and [Net] to enumerate systems.",
        "T1027.001::[BRONZE BUTLER] downloader code has included \"0\" characters at the end of the file to inflate the file size in a likely attempt to evade anti-virus detection.",
        "T1027.003::[BRONZE BUTLER] has used steganography in multiple operations to conceal malicious payloads.",
        "T1036.002::[BRONZE BUTLER] has used Right-to-Left Override to deceive victims into executing several strains of malware.",
        "T1036.005::[BRONZE BUTLER] has given malware the same name as an existing file on the file share server to cause users to unwittingly launch and install the malware on additional systems.",
        "T1036::[BRONZE BUTLER] has masked executables with document file icons including Word and Adobe PDF.",
        "T1039::[BRONZE BUTLER] has exfiltrated files stolen from file shares.",
        "T1053.002::[BRONZE BUTLER] has used [at] to register a scheduled task to execute malware during lateral movement.",
        "T1053.005::[BRONZE BUTLER] has used [schtasks] to register a scheduled task to execute malware during lateral movement.",
        "T1059.001::[BRONZE BUTLER] has used PowerShell for execution.",
        "T1059.003::[BRONZE BUTLER] has used batch scripts and the command-line interface for execution.",
        "T1059.005::[BRONZE BUTLER] has used VBS and VBE scripts for execution.",
        "T1059.006::[BRONZE BUTLER] has made use of Python-based remote access tools.",
        "T1070.004::The [BRONZE BUTLER] uploader or malware the uploader uses command to delete the RAR archives after they have been exfiltrated.",
        "T1071.001::[BRONZE BUTLER] malware has used HTTP for C2.",
        "T1080::[BRONZE BUTLER] has placed malware on file shares and given it the same name as legitimate documents on the share.",
        "T1083::[BRONZE BUTLER] has collected a list of files from the victim and uploaded it to its C2 server, and then created a new list of specific files to steal.",
        "T1087.002::[BRONZE BUTLER] has used net user /domain to identify account information.",
        "T1102.001::[BRONZE BUTLER]'s MSGET downloader uses a dead drop resolver to access malicious payloads.",
        "T1105::[BRONZE BUTLER] has used various tools to download files, including DGet (a similar tool to wget).",
        "T1113::[BRONZE BUTLER] has used a tool to capture screenshots.",
        "T1124::[BRONZE BUTLER] has used net time to check the local time on a target system.",
        "T1132.001::Several [BRONZE BUTLER] tools encode data with base64 when posting it to a C2 server.",
        "T1140::[BRONZE BUTLER] downloads encoded payloads and decodes them on the victim.",
        "T1189::[BRONZE BUTLER] compromised three Japanese websites using a Flash exploit to perform watering hole attacks.",
        "T1203::[BRONZE BUTLER] has exploited Microsoft Office vulnerabilities CVE-2014-4114, CVE-2018-0802, and CVE-2018-0798 for execution.",
        "T1204.002::[BRONZE BUTLER] has attempted to get users to launch malicious Microsoft Word attachments delivered via spearphishing emails.",
        "T1518::[BRONZE BUTLER] has used tools to enumerate software installed on an infected host.",
        "T1547.001::[BRONZE BUTLER] has used a batch script that adds a Registry Run key to establish malware persistence.",
        "T1548.002::[BRONZE BUTLER] has used a Windows 10 specific tool and xxmm to bypass UAC for privilege escalation.",
        "T1550.003::[BRONZE BUTLER] has created forged Kerberos Ticket Granting Ticket (TGT) and Ticket Granting Service (TGS) tickets to maintain administrative access.",
        "T1560.001::[BRONZE BUTLER] has compressed data into password-protected RAR archives prior to exfiltration.",
        "T1562.001::[BRONZE BUTLER] has incorporated code into several tools that attempts to terminate anti-virus processes.",
        "T1566.001::[BRONZE BUTLER] used spearphishing emails with malicious Microsoft Word attachments to infect victims.",
        "T1573.001::[BRONZE BUTLER] has used RC4 encryption (for Datper malware) and AES (for xxmm malware) to obfuscate HTTP traffic. [BRONZE BUTLER] has also used a tool called RarStar that encodes data with a custom XOR algorithm when posting it to a C2 server.",
        "T1574.002::[BRONZE BUTLER] has used legitimate applications to side-load malicious DLLs.",
        "T1588.002::[BRONZE BUTLER] has obtained and used open-source tools such as [Mimikatz], [gsecdump], and [Windows Credential Editor]."
      ]
    },
    "description": "[BRONZE BUTLER](https://attack.mitre.org/groups/G0060) is a cyber espionage group with likely Chinese origins that has been active since at least 2008. The group primarily targets Japanese organizations, particularly those in government, biotechnology, electronics manufacturing, and industrial chemistry.(Citation: Trend Micro Daserf Nov 2017)(Citation: Secureworks BRONZE BUTLER Oct 2017)(Citation: Trend Micro Tick November 2019)"
  }
]
