[
  {
    "id": "intrusion-set--1c63d4ec-0a75-4daa-b1df-0d11af3d3cc1",
    "name": "dragonfly",
    "aliases": "dragonfly|temp.isotope|dymalloy|berserk-bear|tg-4192|crouching-yeti|iron-liberty|energetic-bear",
    "group_id": "G0035",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 2,
        "items": [
          "backdoor.oldrea",
          "trojan.karagany"
        ]
      },
      "tools": {
        "count": 8,
        "items": [
          "crackmapexec",
          "impacket",
          "mcmd",
          "mimikatz",
          "net",
          "netsh",
          "psexec",
          "reg"
        ]
      },
      "techniques": {
        "count": 56,
        "items": [
          "T1003.002",
          "T1003.003",
          "T1003.004",
          "T1005",
          "T1012",
          "T1016",
          "T1018",
          "T1021.001",
          "T1033",
          "T1036",
          "T1053.005",
          "T1059",
          "T1059.001",
          "T1059.003",
          "T1059.006",
          "T1069.002",
          "T1070.001",
          "T1070.004",
          "T1071",
          "T1074.001",
          "T1078",
          "T1083",
          "T1087.002",
          "T1098",
          "T1105",
          "T1110",
          "T1110.002",
          "T1112",
          "T1113",
          "T1114.002",
          "T1133",
          "T1135",
          "T1136.001",
          "T1187",
          "T1189",
          "T1190",
          "T1195.002",
          "T1203",
          "T1204.002",
          "T1210",
          "T1221",
          "T1505.003",
          "T1547.001",
          "T1560",
          "T1562.004",
          "T1564.002",
          "T1566.001",
          "T1583.001",
          "T1583.003",
          "T1584.004",
          "T1588.002",
          "T1591.002",
          "T1595.002",
          "T1598.002",
          "T1598.003",
          "T1608.004"
        ]
      },
      "tactics": {
        "count": 12,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation",
          "reconnaissance",
          "resource-development"
        ]
      },
      "procedures": [
        "T1003.002::[Dragonfly] has dropped and executed SecretsDump to dump password hashes.",
        "T1003.003::[Dragonfly] has dropped and executed SecretsDump to dump password hashes. They also obtained ntds.dit from domain controllers.",
        "T1003.004::[Dragonfly] has dropped and executed SecretsDump to dump password hashes.",
        "T1005::[Dragonfly] has collected data from local victim systems.",
        "T1012::[Dragonfly] has queried the Registry to identify victim information.",
        "T1016::[Dragonfly] has used batch scripts to enumerate network information, including information about trusts, zones, and the domain.",
        "T1018::[Dragonfly] has likely obtained a list of hosts in the victim environment.",
        "T1021.001::[Dragonfly] has moved laterally via RDP.",
        "T1033::[Dragonfly] used the command query user on victim hosts.",
        "T1036::[Dragonfly] has created accounts disguised as legitimate backup and service accounts as well as an email administration account.",
        "T1053.005::[Dragonfly] has used scheduled tasks to automatically log out of created accounts every 8 hours as well as to execute malicious files.",
        "T1059.001::[Dragonfly] has used PowerShell scripts for execution.",
        "T1059.003::[Dragonfly] has used various types of scripting to perform operations, including batch scripts.",
        "T1059.006::[Dragonfly] has used various types of scripting to perform operations, including Python scripts. The group was observed installing Python 2.7 on a victim.",
        "T1059::[Dragonfly] has used the command line for execution.",
        "T1069.002::[Dragonfly] has used batch scripts to enumerate administrators and users in the domain.",
        "T1070.001::[Dragonfly] has cleared Windows event logs and other logs produced by tools they used, including system, security, terminal services, remote services, and audit logs. The actors also deleted specific Registry keys.",
        "T1070.004::[Dragonfly] has deleted many of its files used during operations as part of cleanup, including removing applications and deleting screenshots.",
        "T1071::[Dragonfly] has used SMB for C2.",
        "T1074.001::[Dragonfly] has created a directory named \"out\" in the user's %AppData% folder and copied files to it.",
        "T1078::[Dragonfly] has compromised user credentials and used valid accounts for operations.",
        "T1083::[Dragonfly] has used a batch script to gather folder and file names from victim hosts.",
        "T1087.002::[Dragonfly] has used batch scripts to enumerate users on a victim domain controller.",
        "T1098::[Dragonfly] has added newly created accounts to the administrators group to maintain elevated access.",
        "T1105::[Dragonfly] has copied and installed tools for operations once in the victim environment.",
        "T1110.002::[Dragonfly] has dropped and executed tools used for password cracking, including Hydra and [CrackMapExec].",
        "T1110::[Dragonfly] has attempted to brute force credentials to gain access.",
        "T1112::[Dragonfly] has modified the Registry to perform multiple techniques through the use of [Reg].",
        "T1113::[Dragonfly] has performed screen captures of victims, including by using a tool, scr.exe (which matched the hash of ScreenUtil).",
        "T1114.002::[Dragonfly] has accessed email accounts using Outlook Web Access.",
        "T1133::[Dragonfly] has used VPNs and Outlook Web Access (OWA) to maintain access to victim networks.",
        "T1135::[Dragonfly] has identified and browsed file servers in the victim network, sometimes , viewing files pertaining to ICS or Supervisory Control and Data Acquisition (SCADA) systems.",
        "T1136.001::[Dragonfly] has created accounts on victims, including administrator accounts, some of which appeared to be tailored to each individual staging target.",
        "T1187::[Dragonfly] has gathered hashed user credentials over SMB using spearphishing attachments with external resource links and by modifying .LNK file icon resources to collect credentials from virtualized systems.",
        "T1189::[Dragonfly] has compromised targets via strategic web compromise (SWC) utilizing a custom exploit kit.",
        "T1190::[Dragonfly] has conducted SQL injection attacks, exploited vulnerabilities CVE-2019-19781 and CVE-2020-0688 for Citrix and MS Exchange, and CVE-2018-13379 for Fortinet VPNs.",
        "T1195.002::[Dragonfly] has placed trojanized installers for control system software on legitimate vendor app stores.",
        "T1203::[Dragonfly] has exploited CVE-2011-0611 in Adobe Flash Player to gain execution on a targeted system.",
        "T1204.002::[Dragonfly] has used various forms of spearphishing in attempts to get users to open malicious attachments.",
        "T1210::[Dragonfly] has exploited a Windows Netlogon vulnerability (CVE-2020-1472) to obtain access to Windows Active Directory servers.",
        "T1221::[Dragonfly] has injected SMB URLs into malicious Word spearphishing attachments to initiate [Forced Authentication].",
        "T1505.003::[Dragonfly] has commonly created Web shells on victims' publicly accessible email and web servers, which they used to maintain access to a victim network and download additional malicious files.",
        "T1547.001::[Dragonfly] has added the registry value ntdll to the Registry Run key to establish persistence.",
        "T1560::[Dragonfly] has compressed data into .zip files prior to exfiltration.",
        "T1562.004::[Dragonfly] has disabled host-based firewalls. The group has also globally opened port 3389.",
        "T1564.002::[Dragonfly] has modified the Registry to hide created user accounts.",
        "T1566.001::[Dragonfly] has sent emails with malicious attachments to gain initial access.",
        "T1583.001::[Dragonfly] has registered domains for targeting intended victims.",
        "T1583.003::[Dragonfly] has acquired VPS infrastructure for use in malicious campaigns.",
        "T1584.004::[Dragonfly] has compromised legitimate websites to host C2 and malware modules.",
        "T1588.002::[Dragonfly] has obtained and used tools such as [Mimikatz], [CrackMapExec], and [PsExec].",
        "T1591.002::[Dragonfly] has collected open source information to identify relationships between organizations for targeting purposes.",
        "T1595.002::[Dragonfly] has scanned targeted systems for vulnerable Citrix and Microsoft Exchange services.",
        "T1598.002::[Dragonfly] has used spearphishing with Microsoft Office attachments to enable harvesting of user credentials.",
        "T1598.003::[Dragonfly] has used spearphishing with PDF attachments containing malicious links that redirected to credential harvesting websites.",
        "T1608.004::[Dragonfly] has compromised websites to redirect traffic and to host exploit kits."
      ]
    },
    "description": "[Dragonfly](https://attack.mitre.org/groups/G0035) is a cyber espionage group that has been attributed to Russia's Federal Security Service (FSB) Center 16.(Citation: DOJ Russia Targeting Critical Infrastructure March 2022)(Citation: UK GOV FSB Factsheet April 2022) Active since at least 2010, [Dragonfly](https://attack.mitre.org/groups/G0035) has targeted defense and aviation companies, government entities, companies related to industrial control systems, and critical infrastructure sectors worldwide through supply chain, spearphishing, and drive-by compromise attacks.(Citation: Symantec Dragonfly)(Citation: Secureworks IRON LIBERTY July 2019)(Citation: Symantec Dragonfly Sept 2017)(Citation: Fortune Dragonfly 2.0 Sept 2017)(Citation: Gigamon Berserk Bear October 2021)(Citation: CISA AA20-296A Berserk Bear December 2020)(Citation: Symantec Dragonfly 2.0 October 2017)"
  }
]
