[
  {
    "id": "intrusion-set--6713ab67-e25b-49cc-808d-2b36d4fbc35c",
    "name": "ke3chang",
    "aliases": "ke3chang|apt15|mirage|vixen-panda|gref|playful-dragon|royalapt|nickel",
    "group_id": "G0004",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 3,
        "items": [
          "miragefox",
          "neoichor",
          "okrum"
        ]
      },
      "tools": {
        "count": 8,
        "items": [
          "ipconfig",
          "mimikatz",
          "net",
          "netstat",
          "ping",
          "spwebmember",
          "systeminfo",
          "tasklist"
        ]
      },
      "techniques": {
        "count": 45,
        "items": [
          "T1003.001",
          "T1003.002",
          "T1003.003",
          "T1003.004",
          "T1005",
          "T1007",
          "T1016",
          "T1018",
          "T1020",
          "T1021.002",
          "T1027",
          "T1033",
          "T1036.002",
          "T1036.005",
          "T1041",
          "T1049",
          "T1056.001",
          "T1057",
          "T1059",
          "T1059.003",
          "T1069.002",
          "T1071.001",
          "T1071.004",
          "T1078",
          "T1078.004",
          "T1082",
          "T1083",
          "T1087.001",
          "T1087.002",
          "T1105",
          "T1114.002",
          "T1119",
          "T1133",
          "T1140",
          "T1190",
          "T1213.002",
          "T1543.003",
          "T1547.001",
          "T1558.001",
          "T1560",
          "T1560.001",
          "T1569.002",
          "T1587.001",
          "T1588.002",
          "T1614.001"
        ]
      },
      "tactics": {
        "count": 12,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "exfiltration",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation",
          "resource-development"
        ]
      },
      "procedures": [
        "T1003.001::[Ke3chang] has dumped credentials, including by using [Mimikatz].",
        "T1003.002::[Ke3chang] has dumped credentials, including by using gsecdump.",
        "T1003.003::[Ke3chang] has used NTDSDump and other password dumping tools to gather credentials.",
        "T1003.004::[Ke3chang] has dumped credentials, including by using gsecdump.",
        "T1005::[Ke3chang] gathered information and files from local directories for exfiltration.",
        "T1007::[Ke3chang] performs service discovery using net start commands.",
        "T1016::[Ke3chang] has performed local network configuration discovery using ipconfig.",
        "T1018::[Ke3chang] has used network scanning and enumeration tools, including [Ping].",
        "T1020::[Ke3chang] has performed  frequent and scheduled data exfiltration from compromised networks.",
        "T1021.002::[Ke3chang] actors have been known to copy files to the network shares of other computers to move laterally.",
        "T1027::[Ke3chang] has used Base64-encoded shellcode strings.",
        "T1033::[Ke3chang] has used implants capable of collecting the signed-in username.",
        "T1036.002::[Ke3chang] has used the right-to-left override character in spearphishing attachment names to trick targets into executing .scr and .exe files.",
        "T1036.005::[Ke3chang] has dropped their malware into legitimate installed software paths including: `C:\\ProgramFiles\\Realtek\\Audio\\HDA\\AERTSr.exe`, `C:\\Program Files (x86)\\Foxit Software\\Foxit Reader\\FoxitRdr64.exe`, `C:\\Program Files (x86)\\Adobe\\Flash Player\\AddIns\\airappinstaller\\airappinstall.exe`, and `C:\\Program Files (x86)\\Adobe\\Acrobat Reader DC\\Reader\\AcroRd64.exe`.",
        "T1041::[Ke3chang] transferred compressed and encrypted RAR files containing exfiltration through the established backdoor command and control channel during operations.",
        "T1049::[Ke3chang] performs local network connection discovery using netstat.",
        "T1056.001::[Ke3chang] has used keyloggers.",
        "T1057::[Ke3chang] performs process discovery using tasklist commands.",
        "T1059.003::[Ke3chang] has used batch scripts in its malware to install persistence mechanisms.",
        "T1059::Malware used by [Ke3chang] can run commands on the command-line interface.",
        "T1069.002::[Ke3chang] performs discovery of permission groups net group /domain.",
        "T1071.001::[Ke3chang] malware including RoyalCli and BS2005 have communicated over HTTP with the C2 server through Internet Explorer (IE) by using the COM interface IWebBrowser2.",
        "T1071.004::[Ke3chang] malware RoyalDNS has used DNS for C2.",
        "T1078.004::[Ke3chang] has used compromised credentials to sign into victims’ Microsoft 365 accounts.",
        "T1078::[Ke3chang] has used credential dumpers or stealers to obtain legitimate credentials, which they used to gain access to victim accounts.",
        "T1082::[Ke3chang] performs operating system information discovery using systeminfo and has used implants to identify the system language and computer name.",
        "T1083::[Ke3chang] uses command-line interaction to search files and directories.",
        "T1087.001::[Ke3chang] performs account discovery using commands such as net localgroup administrators and net group \"REDACTED\" /domain on specific permissions groups.",
        "T1087.002::[Ke3chang] performs account discovery using commands such as net localgroup administrators and net group \"REDACTED\" /domain on specific permissions groups.",
        "T1105::[Ke3chang] has used tools to download files to compromised machines.",
        "T1114.002::[Ke3chang] has used compromised credentials and a .NET tool to dump data from Microsoft Exchange mailboxes.",
        "T1119::[Ke3chang] has performed frequent and scheduled data collection from victim networks.",
        "T1133::[Ke3chang] has gained access through VPNs including with compromised accounts and stolen VPN certificates.",
        "T1140::[Ke3chang] has deobfuscated Base64-encoded shellcode strings prior to loading them.",
        "T1190::[Ke3chang] has compromised networks by exploiting Internet-facing applications, including vulnerable Microsoft Exchange and SharePoint servers.",
        "T1213.002::[Ke3chang] used a SharePoint enumeration and data dumping tool known as spwebmember.",
        "T1543.003::[Ke3chang] backdoor RoyalDNS established persistence through adding a service called Nwsapagent.",
        "T1547.001::Several [Ke3chang] backdoors achieved persistence by adding a Run key.",
        "T1558.001::[Ke3chang] has used [Mimikatz] to generate Kerberos golden tickets.",
        "T1560.001::[Ke3chang] is known to use 7Zip and RAR with passwords to encrypt data prior to exfiltration.",
        "T1560::The [Ke3chang] group has been known to compress data before exfiltration.",
        "T1569.002::[Ke3chang] has used a tool known as RemoteExec (similar to [PsExec]) to remotely execute batch scripts and binaries.",
        "T1587.001::[Ke3chang] has developed custom malware that allowed them to maintain persistence on victim networks.",
        "T1588.002::[Ke3chang] has obtained and used tools such as [Mimikatz].",
        "T1614.001::[Ke3chang] has used implants to collect the system language ID of a compromised machine."
      ]
    },
    "description": "[Ke3chang](https://attack.mitre.org/groups/G0004) is a threat group attributed to actors operating out of China. [Ke3chang](https://attack.mitre.org/groups/G0004) has targeted oil, government, diplomatic, military, and NGOs in Central and South America, the Caribbean, Europe, and North America since at least 2010.(Citation: Mandiant Operation Ke3chang November 2014)(Citation: NCC Group APT15 Alive and Strong)(Citation: APT15 Intezer June 2018)(Citation: Microsoft NICKEL December 2021)"
  }
]
