[
  {
    "id": "tool--115f88dd-0618-4389-83cb-98d33ae81848",
    "name": "shimratreporter",
    "aliases": "none",
    "platforms": "windows",
    "tool_id": "S0445",
    "is_revoked": false,
    "profile": {
      "tactics": {
        "count": 6,
        "items": [
          "collection",
          "command-and-control",
          "defense-evasion",
          "discovery",
          "execution",
          "exfiltration"
        ]
      },
      "techniques": {
        "count": 16,
        "items": [
          "T1016",
          "T1020",
          "T1027",
          "T1036.005",
          "T1041",
          "T1049",
          "T1057",
          "T1069",
          "T1071.001",
          "T1082",
          "T1087",
          "T1105",
          "T1106",
          "T1119",
          "T1518",
          "T1560"
        ]
      },
      "adversaries": {
        "count": 1,
        "items": [
          "mofang"
        ]
      },
      "procedures": [
        "T1016::[ShimRatReporter] gathered the local proxy, domain, IP, routing tables, mac address, gateway, DNS servers, and DHCP status information from an infected host.",
        "T1020::[ShimRatReporter] sent collected system and network information compiled into a report to an adversary-controlled C2.",
        "T1027::[ShimRatReporter] encrypted gathered information with a combination of shifting and XOR using a static key.",
        "T1036.005::[ShimRatReporter] spoofed itself as AlphaZawgyl_font.exe, a specialized Unicode font.",
        "T1041::[ShimRatReporter] sent generated reports to the C2 via HTTP POST requests.",
        "T1049::[ShimRatReporter] used the Windows function GetExtendedUdpTable to detect connected UDP endpoints.",
        "T1057::[ShimRatReporter] listed all running processes on the machine.",
        "T1069::[ShimRatReporter] gathered the local privileges for the infected host.",
        "T1071.001::[ShimRatReporter] communicated over HTTP with preconfigured C2 servers.",
        "T1082::[ShimRatReporter] gathered the operating system name and specific Windows version of an infected machine.",
        "T1087::[ShimRatReporter] listed all non-privileged and privileged accounts available on the machine.",
        "T1105::[ShimRatReporter] had the ability to download additional payloads.",
        "T1106::[ShimRatReporter] used several Windows API functions to gather information from the infected system.",
        "T1119::[ShimRatReporter] gathered information automatically, without instruction from a C2, related to the user and host machine that is compiled into a report and sent to the operators.",
        "T1518::[ShimRatReporter] gathered a list of installed software on the infected host.",
        "T1560::[ShimRatReporter] used LZ compression to compress initial reconnaissance reports before sending to the C2."
      ]
    },
    "description": "[ShimRatReporter](https://attack.mitre.org/software/S0445) is a tool used by suspected Chinese adversary [Mofang](https://attack.mitre.org/groups/G0103) to automatically conduct initial discovery. The details from this discovery are used to customize follow-on payloads (such as [ShimRat](https://attack.mitre.org/software/S0444)) as well as set up faux infrastructure which mimics the adversary's targets. [ShimRatReporter](https://attack.mitre.org/software/S0445) has been used in campaigns targeting multiple countries and sectors including government, military, critical infrastructure, automobile, and weapons development.(Citation: FOX-IT May 2016 Mofang)"
  }
]
