[
  {
    "id": "intrusion-set--f9d6633a-55e6-4adc-9263-6ae080421a13",
    "name": "magic-hound",
    "aliases": "magic-hound|ta453|cobalt-illusion|charming-kitten|itg18|phosphorus|newscaster|apt35",
    "group_id": "G0059",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 3,
        "items": [
          "charmpower",
          "downpaper",
          "powerless"
        ]
      },
      "tools": {
        "count": 6,
        "items": [
          "ipconfig",
          "mimikatz",
          "net",
          "netsh",
          "psexec",
          "pupy"
        ]
      },
      "techniques": {
        "count": 58,
        "items": [
          "T1003.001",
          "T1005",
          "T1016",
          "T1021.001",
          "T1027",
          "T1033",
          "T1036.005",
          "T1047",
          "T1049",
          "T1053.005",
          "T1056.001",
          "T1057",
          "T1059.001",
          "T1059.003",
          "T1059.005",
          "T1070.003",
          "T1070.004",
          "T1071",
          "T1071.001",
          "T1082",
          "T1083",
          "T1087.003",
          "T1098.002",
          "T1102.002",
          "T1105",
          "T1112",
          "T1113",
          "T1114",
          "T1114.001",
          "T1114.002",
          "T1136.001",
          "T1189",
          "T1190",
          "T1204.001",
          "T1204.002",
          "T1218.011",
          "T1505.003",
          "T1547.001",
          "T1560.001",
          "T1562",
          "T1562.001",
          "T1562.004",
          "T1564.003",
          "T1566.002",
          "T1566.003",
          "T1571",
          "T1583.001",
          "T1583.006",
          "T1584.001",
          "T1585.001",
          "T1585.002",
          "T1586.002",
          "T1588.002",
          "T1589",
          "T1589.001",
          "T1589.002",
          "T1595.002",
          "T1598.003"
        ]
      },
      "tactics": {
        "count": 12,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation",
          "reconnaissance",
          "resource-development"
        ]
      },
      "procedures": [
        "T1003.001::[Magic Hound] has stolen domain credentials by dumping LSASS process memory with comsvcs.dll and from a Microsoft Active Directory Domain Controller using [Mimikatz].",
        "T1005::[Magic Hound] has used a web shell to exfiltrate a ZIP file containing a dump of LSASS memory on a compromised machine.",
        "T1016::[Magic Hound] malware gathers the victim's local IP address, MAC address, and external IP address.",
        "T1021.001::[Magic Hound] has used Remote Desktop Services on targeted systems.",
        "T1027::[Magic Hound] malware has used base64-encoded commands and files, and has also encrypted embedded strings with AES.",
        "T1033::[Magic Hound] malware has obtained the victim username and sent it to the C2 server.",
        "T1036.005::[Magic Hound] has used the name dllhost.exe to mask a malicious tool used in C2.",
        "T1047::[Magic Hound] has used a tool to run `cmd /c wmic computersystem get domain` for discovery.",
        "T1049::[Magic Hound] has used quser.exe to identify existing RDP connections.",
        "T1053.005::[Magic Hound] has used scheduled tasks to establish persistence.",
        "T1056.001::[Magic Hound] malware is capable of keylogging.",
        "T1057::[Magic Hound] malware can list running processes.",
        "T1059.001::[Magic Hound] has used PowerShell for execution and privilege escalation.",
        "T1059.003::[Magic Hound] has used the command-line interface.",
        "T1059.005::[Magic Hound] malware has used VBS scripts for execution.",
        "T1070.003::[Magic Hound] has removed mailbox export requests from compromised Exchange servers.",
        "T1070.004::[Magic Hound] has deleted and overwrote files to cover tracks.",
        "T1071.001::[Magic Hound] malware has used HTTP for C2.",
        "T1071::[Magic Hound] malware has used IRC for C2.",
        "T1082::[Magic Hound] malware has used a PowerShell command to check the victim system architecture to determine if it is an x64 machine. Other malware has obtained the OS version, UUID, and computer/host name to send to the C2 server.",
        "T1083::[Magic Hound] malware can list a victim's logical drives and the type, as well the total/free space of the fixed devices. Other malware can list a directory's contents.",
        "T1087.003::[Magic Hound] has used Powershell to discover email accounts.",
        "T1098.002::[Magic Hound] granted compromised email accounts read access to the email boxes of additional targeted accounts. The group then was able to authenticate to the intended victim's OWA (Outlook Web Access) portal and read hundreds of email communications for information on Middle East organizations.",
        "T1102.002::[Magic Hound] malware can use a SOAP Web service to communicate with its C2 server.",
        "T1105::[Magic Hound] has downloaded additional code and files from servers onto victims.",
        "T1112::[Magic Hound] has modified Registry settings for security tools.",
        "T1113::[Magic Hound] malware can take a screenshot and upload the file to its C2 server.",
        "T1114.001::[Magic Hound] has collected .PST archives.",
        "T1114.002::[Magic Hound] has exported emails from compromised Exchange servers.",
        "T1114::[Magic Hound] has compromised email credentials in order to steal sensitive data.",
        "T1136.001::[Magic Hound] has created a user named `DefaultAccount` on compromised machines and assigned it to the Administrators and Remote Desktop Users groups.",
        "T1189::[Magic Hound] has conducted watering-hole attacks through media and magazine websites.",
        "T1190::[Magic Hound] has used open-source JNDI exploit kits to exploit Log4j (CVE-2021-44228) and has exploited ProxyShell (CVE-2021-34473, CVE-2021-34523, CVE-2021-31207) on MS Exchange servers.",
        "T1204.001::[Magic Hound] has attempted to lure victims into opening malicious links embedded in emails.",
        "T1204.002::[Magic Hound] has attempted to lure victims into opening malicious email attachments.",
        "T1218.011::[Magic Hound] has used rundll32.exe to execute MiniDump from comsvcs.dll when dumping LSASS memory.",
        "T1505.003::[Magic Hound] has used multiple web shells to gain execution.",
        "T1547.001::[Magic Hound] malware has used Registry Run keys to establish persistence.",
        "T1560.001::[Magic Hound] has used gzip to archive dumped LSASS process memory and RAR to stage and compress local folders.",
        "T1562.001::[Magic Hound] has disabled antivirus services on targeted systems in order to upload malicious payloads.",
        "T1562.004::[Magic Hound] has added the following rule to a victim's Windows firewall to allow RDP traffic - `\"netsh\" advfirewall firewall add rule name=\"Terminal Server\" dir=in action=allow protocol=TCP localport=3389`.",
        "T1562::[Magic Hound] has disabled LSA protection on compromised hosts using `\"reg\" add HKLM\\SYSTEM\\CurrentControlSet\\Control\\LSA /v RunAsPPL /t REG_DWORD /d 0 /f`.",
        "T1564.003::[Magic Hound] malware has a function to determine whether the C2 server wishes to execute the newly dropped file in a hidden window.",
        "T1566.002::[Magic Hound] has sent malicious URL links through email to victims. In some cases the URLs were shortened or linked to Word documents with malicious macros that executed PowerShells scripts to download [Pupy].",
        "T1566.003::[Magic Hound] used various social media channels (such as LinkedIn) as well as messaging services (such as WhatsApp) to spearphish victims.",
        "T1571::[Magic Hound] malware has communicated with its C2 server over TCP port 4443 using HTTP.",
        "T1583.001::[Magic Hound] has registered fraudulent domains such as \"mail-newyorker.com\" and \"news12.com.recover-session-service.site\" to target specific victims with phishing attacks.",
        "T1583.006::[Magic Hound] has acquired Amazon S3 buckets to use in C2.",
        "T1584.001::[Magic Hound] has used compromised domains to host links targeted to specific phishing victims.",
        "T1585.001::[Magic Hound] has created fake LinkedIn and other social media accounts to contact targets and convince them--through messages and voice communications--to open malicious links.",
        "T1585.002::[Magic Hound] has established email accounts using fake personas for spearphishing operations.",
        "T1586.002::[Magic Hound] has compromised personal email accounts through the use of legitimate credentials and gathered additional victim information.",
        "T1588.002::[Magic Hound] has obtained and used open-source penetration testing tools like [Havij], [sqlmap], Metasploit, and [Mimikatz].",
        "T1589.001::[Magic Hound] gathered credentials from two victims that they then attempted to validate across 75 different websites.",
        "T1589.002::[Magic Hound] has acquired the personal email addresses of some individuals they intend to target.",
        "T1589::[Magic Hound] has acquired mobile phone numbers of potential targets, possibly for mobile malware or additional phishing operations.",
        "T1595.002::[Magic Hound] has conducted widespread scanning to identify public-facing systems vulnerable to Log4j (CVE-2021-44228).",
        "T1598.003::[Magic Hound] has used SMS and email messages with links designed to steal credentials."
      ]
    },
    "description": "[Magic Hound](https://attack.mitre.org/groups/G0059) is an Iranian-sponsored threat group that conducts long term, resource-intensive cyber espionage operations, likely on behalf of the Islamic Revolutionary Guard Corps. They have targeted European, U.S., and Middle Eastern government and military personnel, academics, journalists, and organizations such as the World Health Organization (WHO), via complex social engineering campaigns since at least 2014.(Citation: FireEye APT35 2018)(Citation: ClearSky Kittens Back 3 August 2020)(Citation: Certfa Charming Kitten January 2021)(Citation: Secureworks COBALT ILLUSION Threat Profile)(Citation: Proofpoint TA453 July2021)"
  }
]
