[
  {
    "id": "intrusion-set--2a7914cf-dff3-428d-ab0f-1014d1c28aeb",
    "name": "fin6",
    "aliases": "fin6|magecart-group-6|itg08|skeleton-spider",
    "group_id": "G0037",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 8,
        "items": [
          "cobalt-strike",
          "flawedammyy",
          "frameworkpos",
          "grimagent",
          "lockergoga",
          "maze",
          "more_eggs",
          "ryuk"
        ]
      },
      "tools": {
        "count": 4,
        "items": [
          "adfind",
          "mimikatz",
          "psexec",
          "windows-credential-editor"
        ]
      },
      "techniques": {
        "count": 40,
        "items": [
          "T1003.001",
          "T1003.003",
          "T1005",
          "T1018",
          "T1021.001",
          "T1027",
          "T1036.004",
          "T1046",
          "T1047",
          "T1048.003",
          "T1053.005",
          "T1059",
          "T1059.001",
          "T1059.003",
          "T1059.007",
          "T1068",
          "T1070.004",
          "T1074.002",
          "T1078",
          "T1087.002",
          "T1095",
          "T1102",
          "T1110.002",
          "T1119",
          "T1134",
          "T1204.002",
          "T1213",
          "T1547.001",
          "T1553.002",
          "T1555",
          "T1555.003",
          "T1560",
          "T1560.003",
          "T1562.001",
          "T1566.001",
          "T1566.003",
          "T1569.002",
          "T1572",
          "T1573.002",
          "T1588.002"
        ]
      },
      "tactics": {
        "count": 12,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "exfiltration",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation",
          "resource-development"
        ]
      },
      "procedures": [
        "T1003.001::[FIN6] has used [Windows Credential Editor] for credential dumping.",
        "T1003.003::[FIN6] has used Metasploit’s [PsExec] NTDSGRAB module to obtain a copy of the victim's Active Directory database.",
        "T1005::[FIN6] has collected and exfiltrated payment card data from compromised systems.",
        "T1018::[FIN6] used publicly available tools (including Microsoft's built-in SQL querying tool, osql.exe) to map the internal network and conduct reconnaissance against Active Directory, Structured Query Language (SQL) servers, and NetBIOS.",
        "T1021.001::[FIN6] used RDP to move laterally in victim networks.",
        "T1027::[FIN6] has used encoded PowerShell commands.",
        "T1036.004::[FIN6] has renamed the \"psexec\" service name to \"mstdc\" to masquerade as a legitimate Windows service.",
        "T1046::[FIN6] used publicly available tools (including Microsoft's built-in SQL querying tool, osql.exe) to map the internal network and conduct reconnaissance against Active Directory, Structured Query Language (SQL) servers, and NetBIOS.",
        "T1047::[FIN6] has used WMI to automate the remote execution of PowerShell scripts.",
        "T1048.003::[FIN6] has sent stolen payment card data to remote servers via HTTP POSTs.",
        "T1053.005::[FIN6] has used scheduled tasks to establish persistence for various malware it uses, including downloaders known as HARDTACK and SHIPBREAD and [FrameworkPOS].",
        "T1059.001::[FIN6] has used PowerShell to gain access to merchant's networks, and a Metasploit PowerShell module to download and execute shellcode and to set up a local listener.",
        "T1059.003::[FIN6] has used kill.bat script to disable security tools.",
        "T1059.007::[FIN6] has used malicious JavaScript to steal payment card data from e-commerce sites.",
        "T1059::[FIN6] has used scripting to iterate through a list of compromised PoS systems, copy data to a log file, and remove the original data files.",
        "T1068::[FIN6] has used tools to exploit Windows vulnerabilities in order to escalate privileges. The tools targeted CVE-2013-3660, CVE-2011-2005, and CVE-2010-4398, all of which could allow local users to access kernel-level privileges.",
        "T1070.004::[FIN6] has removed files from victim machines.",
        "T1074.002::[FIN6] actors have compressed data from remote systems and moved it to another staging system before exfiltration.",
        "T1078::To move laterally on a victim network, [FIN6] has used credentials stolen from various systems on which it gathered usernames and password hashes.",
        "T1087.002::[FIN6] has used Metasploit’s [PsExec] NTDSGRAB module to obtain a copy of the victim's Active Directory database.",
        "T1095::[FIN6] has used Metasploit Bind and Reverse TCP stagers.",
        "T1102::[FIN6] has used Pastebin and Google Storage to host content for their operations.",
        "T1110.002::[FIN6] has extracted password hashes from ntds.dit to crack offline.",
        "T1119::[FIN6] has used a script to iterate through a list of compromised PoS systems, copy and remove data to a log file, and to bind to events from the submit payment button.",
        "T1134::[FIN6] has used has used Metasploit’s named-pipe impersonation technique to escalate privileges.",
        "T1204.002::[FIN6] has used malicious documents to lure victims into allowing execution of PowerShell scripts.",
        "T1213::[FIN6] has collected schemas and user accounts from systems running SQL Server.",
        "T1547.001::[FIN6] has used Registry Run keys to establish persistence for its downloader tools known as HARDTACK and SHIPBREAD.",
        "T1553.002::[FIN6] has used Comodo code-signing certificates.",
        "T1555.003::[FIN6] has used the Stealer One credential stealer to target web browsers.",
        "T1555::[FIN6] has used the Stealer One credential stealer to target e-mail and file transfer utilities including FTP.",
        "T1560.003::[FIN6] has encoded data gathered from the victim with a simple substitution cipher and single-byte XOR using the 0xAA key, and Base64 with character permutation.",
        "T1560::Following data collection, [FIN6] has compressed log files into a ZIP archive prior to staging and exfiltration.",
        "T1562.001::[FIN6] has deployed a utility script named kill.bat to disable anti-virus.",
        "T1566.001::[FIN6] has targeted victims with e-mails containing malicious attachments.",
        "T1566.003::[FIN6] has used fake job advertisements sent via LinkedIn to spearphish targets.",
        "T1569.002::[FIN6] has created Windows services to execute encoded PowerShell commands.",
        "T1572::[FIN6] used the Plink command-line utility to create SSH tunnels to C2 servers.",
        "T1573.002::[FIN6] used the Plink command-line utility to create SSH tunnels to C2 servers.",
        "T1588.002::[FIN6] has obtained and used tools such as [Mimikatz], [Cobalt Strike], and [AdFind]."
      ]
    },
    "description": "[FIN6](https://attack.mitre.org/groups/G0037) is a cyber crime group that has stolen payment card data and sold it for profit on underground marketplaces. This group has aggressively targeted and compromised point of sale (PoS) systems in the hospitality and retail sectors.(Citation: FireEye FIN6 April 2016)(Citation: FireEye FIN6 Apr 2019)"
  }
]
