[
  {
    "id": "intrusion-set--2e290bfe-93b5-48ce-97d6-edcd6d32b7cf",
    "name": "gamaredon-group",
    "aliases": "gamaredon-group|iron-tilden|primitive-bear|actinium|armageddon|shuckworm|dev-0157",
    "group_id": "G0047",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 3,
        "items": [
          "powerpunch",
          "pteranodon",
          "quietsieve"
        ]
      },
      "tools": {
        "count": 1,
        "items": [
          "ping"
        ]
      },
      "techniques": {
        "count": 47,
        "items": [
          "T1005",
          "T1016.001",
          "T1020",
          "T1021.005",
          "T1025",
          "T1027",
          "T1027.001",
          "T1027.004",
          "T1033",
          "T1036.005",
          "T1039",
          "T1041",
          "T1047",
          "T1053.005",
          "T1057",
          "T1059.001",
          "T1059.003",
          "T1059.005",
          "T1070.004",
          "T1071.001",
          "T1080",
          "T1082",
          "T1083",
          "T1102",
          "T1105",
          "T1106",
          "T1112",
          "T1113",
          "T1119",
          "T1120",
          "T1137",
          "T1140",
          "T1204.002",
          "T1218.005",
          "T1218.011",
          "T1221",
          "T1485",
          "T1491.001",
          "T1534",
          "T1547.001",
          "T1559.001",
          "T1562.001",
          "T1564.003",
          "T1566.001",
          "T1568",
          "T1583.001",
          "T1608.001"
        ]
      },
      "tactics": {
        "count": 12,
        "items": [
          "collection",
          "command-and-control",
          "defense-evasion",
          "discovery",
          "execution",
          "exfiltration",
          "impact",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation",
          "resource-development"
        ]
      },
      "procedures": [
        "T1005::[Gamaredon Group] has collected files from infected systems and uploaded them to a C2 server.",
        "T1016.001::[Gamaredon Group] has tested connectivity between a compromised machine and a C2 server using  [Ping] with commands such as `CSIDL_SYSTEM\\cmd.exe /c ping -n 1`.",
        "T1020::[Gamaredon Group] has used modules that automatically upload gathered documents to the C2 server.",
        "T1021.005::[Gamaredon Group] has used VNC tools, including UltraVNC, to remotely interact with compromised hosts.",
        "T1025::A [Gamaredon Group] file stealer has the capability to steal data from newly connected logical volumes on a system, including USB drives.",
        "T1027.001::[Gamaredon Group] has obfuscated .NET executables by inserting junk code.",
        "T1027.004::[Gamaredon Group] has compiled the source code for a downloader directly on the infected system using the built-in Microsoft.CSharp.CSharpCodeProvider class.",
        "T1027::[Gamaredon Group] has delivered self-extracting 7z archive files within malicious document attachments, and used obfuscated or encrypted scripts.",
        "T1033::A [Gamaredon Group] file stealer can gather the victim's username to send to a C2 server.",
        "T1036.005::[Gamaredon Group] has used legitimate process names to hide malware including svchosst.",
        "T1039::[Gamaredon Group] malware has collected Microsoft Office documents from mapped network drives.",
        "T1041::A [Gamaredon Group] file stealer can transfer collected files to a hardcoded C2 server.",
        "T1047::[Gamaredon Group] has used WMI to execute scripts used for discovery.",
        "T1053.005::[Gamaredon Group] has created scheduled tasks to launch executables after a designated number of minutes have passed.",
        "T1057::[Gamaredon Group] has used tools to enumerate processes on target hosts including Process Explorer.",
        "T1059.001::[Gamaredon Group] has used obfuscated PowerShell scripts for staging.",
        "T1059.003::[Gamaredon Group] has used various batch scripts to establish C2 and download additional files. [Gamaredon Group]'s backdoor malware has also been written to a batch file.",
        "T1059.005::[Gamaredon Group] has embedded malicious macros in document templates, which executed VBScript. [Gamaredon Group] has also delivered Microsoft Outlook VBA projects with embedded macros.",
        "T1070.004::[Gamaredon Group] tools can delete files used during an operation.",
        "T1071.001::[Gamaredon Group] has used HTTP and HTTPS for C2 communications.",
        "T1080::[Gamaredon Group] has injected malicious macros into all Word and Excel documents on mapped network drives.",
        "T1082::A [Gamaredon Group] file stealer can gather the victim's computer name and drive serial numbers to send to a C2 server.",
        "T1083::[Gamaredon Group] macros can scan for Microsoft Word and Excel files to inject with additional malicious macros. [Gamaredon Group] has also used its backdoors to automatically list interesting files (such as Office documents) found on a system.",
        "T1102::[Gamaredon Group] has used GitHub repositories for downloaders which will be obtained by the group's .NET executable on the compromised system.",
        "T1105::[Gamaredon Group] has downloaded additional malware and tools onto a compromised host.",
        "T1106::[Gamaredon Group] malware has used CreateProcess to launch additional malicious components.",
        "T1112::[Gamaredon Group] has removed security settings for VBA macro execution by changing registry values HKCU\\Software\\Microsoft\\Office\\&lt;version&gt;\\&lt;product&gt;\\Security\\VBAWarnings and HKCU\\Software\\Microsoft\\Office\\&lt;version&gt;\\&lt;product&gt;\\Security\\AccessVBOM.",
        "T1113::[Gamaredon Group]'s malware can take screenshots of the compromised computer every minute.",
        "T1119::[Gamaredon Group] has deployed scripts on compromised systems that automatically scan for interesting documents.",
        "T1120::[Gamaredon Group] tools have contained an application to check performance of USB flash drives. [Gamaredon Group] has also used malware to scan for removable drives.",
        "T1137::[Gamaredon Group] has inserted malicious macros into existing documents, providing persistence when they are reopened. [Gamaredon Group] has loaded the group's previously delivered VBA project by relaunching Microsoft Outlook with the /altvba option, once the Application.Startup event is received.",
        "T1140::[Gamaredon Group] tools decrypted additional payloads from the C2. [Gamaredon Group] has also decoded base64-encoded source code of a downloader.",
        "T1204.002::[Gamaredon Group] has attempted to get users to click on Office attachments with malicious macros embedded.",
        "T1218.005::[Gamaredon Group] has used `mshta.exe` to execute malicious HTA files.",
        "T1218.011::[Gamaredon Group] malware has used rundll32 to launch additional malicious components.",
        "T1221::[Gamaredon Group] has used DOCX files to download malicious DOT document templates and has used RTF template injection to download malicious payloads.",
        "T1485::[Gamaredon Group] has used tools to delete files and folders from victims' desktops and profiles.",
        "T1491.001::[Gamaredon Group] has left taunting images and messages on the victims' desktops as proof of system access.",
        "T1534::[Gamaredon Group] has used an Outlook VBA module on infected systems to send phishing emails with malicious attachments to other employees within the organization.",
        "T1547.001::[Gamaredon Group] tools have registered Run keys in the registry to give malicious VBS files persistence.",
        "T1559.001::[Gamaredon Group] malware can insert malicious macros into documents using a Microsoft.Office.Interop object.",
        "T1562.001::[Gamaredon Group] has delivered macros which can tamper with Microsoft Office security settings.",
        "T1564.003::[Gamaredon Group] has used hidcon to run batch files in a hidden console window.",
        "T1566.001::[Gamaredon Group] has delivered spearphishing emails with malicious attachments to targets.",
        "T1568::[Gamaredon Group] has incorporated dynamic DNS domains in its infrastructure.",
        "T1583.001::[Gamaredon Group] has registered multiple domains to facilitate payload staging and C2.",
        "T1608.001::[Gamaredon Group] has registered domains to stage payloads."
      ]
    },
    "description": "[Gamaredon Group](https://attack.mitre.org/groups/G0047) is a suspected Russian cyber espionage threat group that has targeted military, NGO, judiciary, law enforcement, and non-profit organizations in Ukraine since at least 2013. The name [Gamaredon Group](https://attack.mitre.org/groups/G0047) comes from a misspelling of the word \"Armageddon\", which was detected in the adversary's early campaigns.(Citation: Palo Alto Gamaredon Feb 2017)(Citation: TrendMicro Gamaredon April 2020)(Citation: ESET Gamaredon June 2020)(Citation: Symantec Shuckworm January 2022)(Citation: Microsoft Actinium February 2022)\n\nIn November 2021, the Ukrainian government publicly attributed [Gamaredon Group](https://attack.mitre.org/groups/G0047) to Russia's Federal Security Service (FSB) Center 18.(Citation: Bleepingcomputer Gamardeon FSB November 2021)(Citation: Microsoft Actinium February 2022)"
  }
]
