[
  {
    "id": "intrusion-set--7a19ecb1-3c65-4de3-a230-993516aed6a6",
    "name": "turla",
    "aliases": "turla|iron-hunter|group-88|belugasturgeon|waterbug|whitebear|snake|krypton|venomous-bear",
    "group_id": "G0010",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 13,
        "items": [
          "carbon",
          "comrat",
          "crutch",
          "epic",
          "gazer",
          "hyperstack",
          "kazuar",
          "lightneuron",
          "mosquito",
          "penquin",
          "powerstallion",
          "tinyturla",
          "uroburos"
        ]
      },
      "tools": {
        "count": 13,
        "items": [
          "arp",
          "certutil",
          "empire",
          "ironnetinjector",
          "mimikatz",
          "nbtscan",
          "nbtstat",
          "net",
          "netstat",
          "psexec",
          "reg",
          "systeminfo",
          "tasklist"
        ]
      },
      "techniques": {
        "count": 65,
        "items": [
          "T1005",
          "T1007",
          "T1012",
          "T1016",
          "T1016.001",
          "T1018",
          "T1021.002",
          "T1025",
          "T1027",
          "T1027.005",
          "T1049",
          "T1055",
          "T1055.001",
          "T1057",
          "T1059.001",
          "T1059.003",
          "T1059.005",
          "T1059.006",
          "T1059.007",
          "T1068",
          "T1069.001",
          "T1069.002",
          "T1071.001",
          "T1071.003",
          "T1078.003",
          "T1082",
          "T1083",
          "T1087.001",
          "T1087.002",
          "T1090",
          "T1090.001",
          "T1102",
          "T1102.002",
          "T1105",
          "T1106",
          "T1110",
          "T1112",
          "T1120",
          "T1124",
          "T1134.002",
          "T1140",
          "T1189",
          "T1201",
          "T1204.001",
          "T1213",
          "T1518.001",
          "T1546.003",
          "T1546.013",
          "T1547.001",
          "T1547.004",
          "T1553.006",
          "T1555.004",
          "T1560.001",
          "T1562.001",
          "T1566.002",
          "T1567.002",
          "T1570",
          "T1583.006",
          "T1584.003",
          "T1584.004",
          "T1584.006",
          "T1587.001",
          "T1588.001",
          "T1588.002",
          "T1615"
        ]
      },
      "tactics": {
        "count": 12,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "exfiltration",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation",
          "resource-development"
        ]
      },
      "procedures": [
        "T1005::[Turla] RPC backdoors can upload files from victim machines.",
        "T1007::[Turla] surveys a system upon check-in to discover running services and associated processes using the tasklist /svc command.",
        "T1012::[Turla] surveys a system upon check-in to discover information in the Windows Registry with the reg query command.",
        "T1016.001::[Turla] has used tracert to check internet connectivity.",
        "T1016::[Turla] surveys a system upon check-in to discover network configuration details using the arp -a, nbtstat -n, net config, ipconfig /all, and route commands, as well as [NBTscan].",
        "T1018::[Turla] surveys a system upon check-in to discover remote systems on a local network using the net view and net view /DOMAIN commands. [Turla] has also used net group \"Domain Computers\" /domain, net group \"Domain Controllers\" /domain, and net group \"Exchange Servers\" /domain to enumerate domain computers, including the organization's DC and Exchange Server.",
        "T1021.002::[Turla] used net use commands to connect to lateral systems within a network.",
        "T1025::[Turla] RPC backdoors can collect files from USB thumb drives.",
        "T1027.005::Based on comparison of [Gazer] versions, [Turla] made an effort to obfuscate strings in the malware that could be used as IoCs, including the mutex name and named pipe.",
        "T1027::[Turla] has used encryption (including salted 3DES via [PowerSploit]'s Out-EncryptedScript.ps1), random variable names, and base64 encoding to obfuscate PowerShell commands and payloads.",
        "T1049::[Turla] surveys a system upon check-in to discover active local network connections using the netstat -an, net use, net file, and net session commands.",
        "T1055.001::[Turla] has used Metasploit to perform reflective DLL injection in order to escalate privileges.",
        "T1055::[Turla] has also used [PowerSploit]'s Invoke-ReflectivePEInjection.ps1 to reflectively load a PowerShell payload into a random process on the victim system.",
        "T1057::[Turla] surveys a system upon check-in to discover running processes using the tasklist /v command.",
        "T1059.001::[Turla] has used PowerShell to execute commands/scripts, in some cases via a custom executable or code from [Empire]'s PSInject. has also used PowerShell scripts to load and execute malware in memory.",
        "T1059.003::[Turla] RPC backdoors have used cmd.exe to execute commands.",
        "T1059.005::[Turla] has used VBS scripts throughout its operations.",
        "T1059.006::[Turla] has used IronPython scripts as part of the [IronNetInjector] toolchain to drop payloads.",
        "T1059.007::[Turla] has used various JavaScript-based backdoors.",
        "T1068::[Turla] has exploited vulnerabilities in the VBoxDrv.sys driver to obtain kernel mode privileges.",
        "T1069.001::[Turla] has used net localgroup and net localgroup Administrators to enumerate group information, including members of the local administrators group.",
        "T1069.002::[Turla] has used net group \"Domain Admins\" /domain to identify domain administrators.",
        "T1071.001::[Turla] has used HTTP and HTTPS for C2 communications.",
        "T1071.003::[Turla] has used multiple backdoors which communicate with a C2 server via email attachments.",
        "T1078.003::[Turla] has abused local accounts that have the same password across the victim’s network.",
        "T1082::[Turla] surveys a system upon check-in to discover operating system configuration details using the systeminfo and set commands.",
        "T1083::[Turla] surveys a system upon check-in to discover files in specific locations on the hard disk %TEMP% directory, the current user's desktop, the Program Files directory, and Recent.",
        "T1087.001::[Turla] has used net user to enumerate local accounts on the system.",
        "T1087.002::[Turla] has used net user /domain to enumerate domain accounts.",
        "T1090.001::[Turla] has compromised internal network systems to act as a proxy to forward traffic to C2.",
        "T1090::[Turla] RPC backdoors have included local UPnP RPC proxies.",
        "T1102.002::A [Turla] JavaScript backdoor has used Google Apps Script as its C2 server.",
        "T1102::[Turla] has used legitimate web services including Pastebin, Dropbox, and GitHub for C2 communications.",
        "T1105::[Turla] has used shellcode to download Meterpreter after compromising a victim.",
        "T1106::[Turla] and its RPC backdoors have used APIs calls for various tasks related to subverting AMSI and accessing then executing commands through RPC and/or named pipes.",
        "T1110::[Turla] may attempt to connect to systems within a victim's network using net use commands and a predefined list or collection of passwords.",
        "T1112::[Turla] has used the Registry to store encrypted payloads.",
        "T1120::[Turla] has used fsutil fsinfo drives to list connected drives.",
        "T1124::[Turla] surveys a system upon check-in to discover the system time by using the net time command.",
        "T1134.002::[Turla] RPC backdoors can impersonate or steal process tokens before executing commands.",
        "T1140::[Turla] has used a custom decryption routine, which pulls key and salt values from other artifacts such as a WMI filter or [PowerShell Profile], to decode encrypted PowerShell payloads.",
        "T1189::[Turla] has infected victims using watering holes.",
        "T1201::[Turla] has used net accounts and net accounts /domain to acquire password policy information.",
        "T1204.001::[Turla] has used spearphishing via a link to get users to download and run their malware.",
        "T1213::[Turla] has used a custom .NET tool to collect documents from an organization's internal central database.",
        "T1518.001::[Turla] has obtained information on security software, including security logging information that may indicate whether their malware has been detected.",
        "T1546.003::[Turla] has used WMI event filters and consumers to establish persistence.",
        "T1546.013::[Turla] has used PowerShell profiles to maintain persistence on an infected machine.",
        "T1547.001::A [Turla] Javascript backdoor added a local_update_check value under the Registry key HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run to establish persistence. Additionally, a [Turla] custom executable containing Metasploit shellcode is saved to the Startup folder to gain persistence.",
        "T1547.004::[Turla] established persistence by adding a Shell value under the Registry key HKCU\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon.",
        "T1553.006::[Turla] has modified variables in kernel memory to turn off Driver Signature Enforcement after exploiting vulnerabilities that obtained kernel mode privileges.",
        "T1555.004::[Turla] has gathered credentials from the Windows Credential Manager tool.",
        "T1560.001::[Turla] has encrypted files stolen from connected USB drives into a RAR file before exfiltration.",
        "T1562.001::[Turla] has used a AMSI bypass, which patches the in-memory amsi.dll, in PowerShell scripts to bypass Windows antimalware products.",
        "T1566.002::[Turla] attempted to trick targets into clicking on a link featuring a seemingly legitimate domain from Adobe.com to download their malware and gain initial access.",
        "T1567.002::[Turla] has used WebDAV to upload stolen USB files to a cloud drive.",
        "T1570::[Turla] RPC backdoors can be used to transfer files to/from victim machines on the local network.",
        "T1583.006::[Turla] has created web accounts including Dropbox and GitHub for C2 and document exfiltration.",
        "T1584.003::[Turla] has used the VPS infrastructure of compromised Iranian threat actors.",
        "T1584.004::[Turla] has used compromised servers as infrastructure.",
        "T1584.006::[Turla] has frequently used compromised WordPress sites for C2 infrastructure.",
        "T1587.001::[Turla] has developed its own unique malware for use in operations.",
        "T1588.001::[Turla] has used malware obtained after compromising other threat actors, such as [OilRig].",
        "T1588.002::[Turla] has obtained and customized publicly-available tools like [Mimikatz].",
        "T1615::[Turla] surveys a system upon check-in to discover Group Policy details using the gpresult command."
      ]
    },
    "description": "[Turla](https://attack.mitre.org/groups/G0010) is a Russian-based threat group that has infected victims in over 45 countries, spanning a range of industries including government, embassies, military, education, research and pharmaceutical companies since 2004. Heightened activity was seen in mid-2015. [Turla](https://attack.mitre.org/groups/G0010) is known for conducting watering hole and spearphishing campaigns and leveraging in-house tools and malware. [Turla](https://attack.mitre.org/groups/G0010)’s espionage platform is mainly used against Windows machines, but has also been seen used against macOS and Linux machines.(Citation: Kaspersky Turla)(Citation: ESET Gazer Aug 2017)(Citation: CrowdStrike VENOMOUS BEAR)(Citation: ESET Turla Mosquito Jan 2018)"
  }
]
