[
  {
    "id": "intrusion-set--00f67a77-86a4-4adf-be26-1a54fc713340",
    "name": "apt38",
    "aliases": "apt38|nickel-gladstone|beagleboyz|bluenoroff|stardust-chollima",
    "group_id": "G0082",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 4,
        "items": [
          "darkcomet",
          "eccentricbandwagon",
          "hoplight",
          "killdisk"
        ]
      },
      "tools": {
        "count": 2,
        "items": [
          "mimikatz",
          "net"
        ]
      },
      "techniques": {
        "count": 43,
        "items": [
          "T1005",
          "T1027.002",
          "T1033",
          "T1049",
          "T1053.003",
          "T1053.005",
          "T1056.001",
          "T1057",
          "T1059.001",
          "T1059.003",
          "T1059.005",
          "T1070.001",
          "T1070.004",
          "T1070.006",
          "T1071.001",
          "T1082",
          "T1083",
          "T1105",
          "T1106",
          "T1110",
          "T1112",
          "T1115",
          "T1135",
          "T1189",
          "T1204.002",
          "T1217",
          "T1218.001",
          "T1218.011",
          "T1485",
          "T1486",
          "T1505.003",
          "T1518.001",
          "T1529",
          "T1543.003",
          "T1561.002",
          "T1562.003",
          "T1562.004",
          "T1565.001",
          "T1565.002",
          "T1565.003",
          "T1566.001",
          "T1569.002",
          "T1588.002"
        ]
      },
      "tactics": {
        "count": 11,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "impact",
          "initial-access",
          "persistence",
          "privilege-escalation",
          "resource-development"
        ]
      },
      "procedures": [
        "T1005::[APT38] has collected data from a compromised host.",
        "T1027.002::[APT38] has used several code packing methods such as Themida, Enigma, VMProtect, and Obsidium, to pack their implants.",
        "T1033::[APT38] has identified primary users, currently logged in users, sets of users that commonly use a system, or inactive users.",
        "T1049::[APT38] installed a port monitoring tool, MAPMAKER, to print the active TCP connections on the local system.",
        "T1053.003::[APT38] has used cron to create pre-scheduled and periodic background jobs on a Linux system.",
        "T1053.005::[APT38] has used Task Scheduler to run programs at system startup or on a scheduled basis for persistence.",
        "T1056.001::[APT38] used a Trojan called KEYLIME to capture keystrokes from the victim’s machine.",
        "T1057::[APT38] leveraged Sysmon to understand the processes, services in the organization.",
        "T1059.001::[APT38] has used PowerShell to execute commands and other operational tasks.",
        "T1059.003::[APT38] has used a command-line tunneler, NACHOCHEESE, to give them shell access to a victim’s machine.",
        "T1059.005::[APT38] has used VBScript to execute commands and other operational tasks.",
        "T1070.001::[APT38] clears Window Event logs and Sysmon logs from the system.",
        "T1070.004::[APT38] has used a utility called CLOSESHAVE that can securely delete a file from the system. They have also removed malware, tools, or other non-native files used during the intrusion to reduce their footprint or as part of the post-intrusion cleanup process.",
        "T1070.006::[APT38] has modified data timestamps to mimic files that are in the same folder on a compromised host.",
        "T1071.001::[APT38] used a backdoor, QUICKRIDE, to communicate to the C2 server over HTTP and HTTPS.",
        "T1082::[APT38] has attempted to get detailed information about a compromised host, including the operating system, version, patches, hotfixes, and service packs.",
        "T1083::[APT38] have enumerated files and directories, or searched in specific locations within a compromised host.",
        "T1105::[APT38] used a backdoor, NESTEGG, that has the capability to download and upload files to and from a victim’s machine.",
        "T1106::[APT38] has used the Windows API to execute code within a victim's system.",
        "T1110::[APT38] has used brute force techniques to attempt account access when passwords are unknown or when password hashes are unavailable.",
        "T1112::[APT38] uses a tool called CLEANTOAD that has the capability to modify Registry keys.",
        "T1115::[APT38] used a Trojan called KEYLIME to collect data from the clipboard.",
        "T1135::[APT38] has enumerated network shares on a compromised host.",
        "T1189::[APT38] has conducted watering holes schemes to gain initial access to victims.",
        "T1204.002::[APT38]  has attempted to lure victims into enabling malicious macros within email attachments.",
        "T1217::[APT38] has collected browser bookmark information to learn more about compromised hosts, obtain personal information about users, and acquire details about internal network resources.",
        "T1218.001::[APT38] has used CHM files to move concealed payloads.",
        "T1218.011::[APT38] has used rundll32.exe to execute binaries, scripts, and Control Panel Item files and to execute code via proxy to avoid triggering security tools.",
        "T1485::[APT38] has used a custom secure delete function to make deleted files unrecoverable.",
        "T1486::[APT38] has used Hermes ransomware to encrypt files with AES256.",
        "T1505.003::[APT38] has used web shells for persistence or to ensure redundant access.",
        "T1518.001::[APT38] has identified security software, configurations, defensive tools, and sensors installed on a compromised system.",
        "T1529::[APT38] has used a custom MBR wiper named BOOTWRECK, which will initiate a system reboot after wiping the victim's MBR.",
        "T1543.003::[APT38] has installed a new Windows service to establish persistence.",
        "T1561.002::[APT38] has used a custom MBR wiper named BOOTWRECK to render systems inoperable.",
        "T1562.003::[APT38] has prepended a space to all of their terminal commands to operate without leaving traces in the HISTCONTROL environment.",
        "T1562.004::[APT38] have created firewall exemptions on specific ports, including ports 443, 6443, 8443, and 9443.",
        "T1565.001::[APT38] has used DYEPACK to create, delete, and alter records in databases used for SWIFT transactions.",
        "T1565.002::[APT38] has used DYEPACK to manipulate SWIFT messages en route to a printer.",
        "T1565.003::[APT38] has used DYEPACK.FOX to manipulate PDF data as it is accessed to remove traces of fraudulent SWIFT transactions from the data displayed to the end user.",
        "T1566.001::[APT38] has conducted spearphishing campaigns using malicious email attachments.",
        "T1569.002::[APT38] has created new services or modified existing ones to run executables, commands, or scripts.",
        "T1588.002::[APT38] has obtained and used open-source tools such as [Mimikatz]."
      ]
    },
    "description": "[APT38](https://attack.mitre.org/groups/G0082) is a North Korean state-sponsored threat group that specializes in financial cyber operations; it has been attributed to the Reconnaissance General Bureau.(Citation: CISA AA20-239A BeagleBoyz August 2020) Active since at least 2014, [APT38](https://attack.mitre.org/groups/G0082) has targeted banks, financial institutions, casinos, cryptocurrency exchanges, SWIFT system endpoints, and ATMs in at least 38 countries worldwide. Significant operations include the 2016 Bank of Bangladesh heist, during which [APT38](https://attack.mitre.org/groups/G0082) stole $81 million, as well as attacks against Bancomext (2018) and Banco de Chile (2018); some of their attacks have been destructive.(Citation: CISA AA20-239A BeagleBoyz August 2020)(Citation: FireEye APT38 Oct 2018)(Citation: DOJ North Korea Indictment Feb 2021)(Citation: Kaspersky Lazarus Under The Hood Blog 2017)\n\nNorth Korean group definitions are known to have significant overlap, and some security researchers report all North Korean state-sponsored cyber activity under the name [Lazarus Group](https://attack.mitre.org/groups/G0032) instead of tracking clusters or subgroups."
  }
]
