[
  {
    "id": "tool--cb69b20d-56d0-41ab-8440-4a4b251614d4",
    "name": "pupy",
    "aliases": "none",
    "platforms": "linux|windows|macos|android",
    "tool_id": "S0192",
    "is_revoked": false,
    "profile": {
      "tactics": {
        "count": 10,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "exfiltration",
          "lateral-movement",
          "persistence",
          "privilege-escalation"
        ]
      },
      "techniques": {
        "count": 40,
        "items": [
          "T1003.001",
          "T1003.004",
          "T1003.005",
          "T1016",
          "T1021.001",
          "T1033",
          "T1041",
          "T1046",
          "T1049",
          "T1055.001",
          "T1056.001",
          "T1057",
          "T1059.001",
          "T1059.006",
          "T1070.001",
          "T1071.001",
          "T1082",
          "T1083",
          "T1087.001",
          "T1105",
          "T1113",
          "T1114.001",
          "T1123",
          "T1125",
          "T1134.001",
          "T1135",
          "T1136.001",
          "T1136.002",
          "T1497.001",
          "T1543.002",
          "T1547.001",
          "T1548.002",
          "T1550.003",
          "T1552.001",
          "T1555",
          "T1555.003",
          "T1557.001",
          "T1560.001",
          "T1569.002",
          "T1573.002"
        ]
      },
      "adversaries": {
        "count": 2,
        "items": [
          "apt33",
          "magic-hound"
        ]
      },
      "procedures": [
        "T1003.001::[Pupy] can execute Lazagne as well as [Mimikatz] using PowerShell.",
        "T1003.004::[Pupy] can use Lazagne for harvesting credentials.",
        "T1003.005::[Pupy] can use Lazagne for harvesting credentials.",
        "T1016::[Pupy] has built in commands to identify a host’s IP address and find out other network configuration settings by viewing connected sessions.",
        "T1021.001::[Pupy] can enable/disable RDP connection and can start a remote desktop session using a browser web socket client.",
        "T1033::[Pupy] can enumerate local information for Linux hosts and find currently logged on users for Windows hosts.",
        "T1041::[Pupy] can send screenshots files, keylogger data, files, and recorded audio back to the C2 server.",
        "T1046::[Pupy] has a built-in module for port scanning.",
        "T1049::[Pupy] has a built-in utility command for netstat, can do net session through PowerView, and has an interactive shell which can be used to discover additional information.",
        "T1055.001::[Pupy] can migrate into another process using reflective DLL injection.",
        "T1056.001::[Pupy] uses a keylogger to capture keystrokes it then sends back to the server after it is stopped.",
        "T1057::[Pupy] can list the running processes and get the process ID and parent process’s ID.",
        "T1059.001::[Pupy] has a module for loading and executing PowerShell scripts.",
        "T1059.006::[Pupy] can use an add on feature when creating payloads that allows you to create custom Python scripts (“scriptlets”) to perform tasks offline (without requiring a session) such as sandbox detection, adding persistence, etc.",
        "T1070.001::[Pupy] has a module to clear event logs with PowerShell.",
        "T1071.001::[Pupy] can communicate over HTTP for C2.",
        "T1082::[Pupy] can grab a system’s information including the OS version, architecture, etc.",
        "T1083::[Pupy] can walk through directories and recursively search for strings in files.",
        "T1087.001::[Pupy] uses PowerView and Pywerview to perform discovery commands such as net user, net group, net local group, etc.",
        "T1105::[Pupy] can upload and download to/from a victim machine.",
        "T1113::[Pupy] can drop a mouse-logger that will take small screenshots around at each click and then send back to the server.",
        "T1114.001::[Pupy] can interact with a victim’s Outlook session and look through folders and emails.",
        "T1123::[Pupy] can record sound with the microphone.",
        "T1125::[Pupy] can access a connected webcam and capture pictures.",
        "T1134.001::[Pupy] can obtain a list of SIDs and provide the option for selecting process tokens to impersonate.",
        "T1135::[Pupy] can list local and remote shared drives and folders over SMB.",
        "T1136.001::[Pupy] can user PowerView to execute “net user” commands and create local system accounts.",
        "T1136.002::[Pupy] can user PowerView to execute “net user” commands and create domain accounts.",
        "T1497.001::[Pupy] has a module that checks a number of indicators on the system to determine if its running on a virtual machine.",
        "T1543.002::[Pupy] can be used to establish persistence using a systemd service.",
        "T1547.001::[Pupy] adds itself to the startup folder or adds itself to the Registry key SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run for persistence.",
        "T1548.002::[Pupy] can bypass Windows UAC through either DLL hijacking, eventvwr, or appPaths.",
        "T1550.003::[Pupy] can also perform pass-the-ticket.",
        "T1552.001::[Pupy] can use Lazagne for harvesting credentials.",
        "T1555.003::[Pupy] can use Lazagne for harvesting credentials.",
        "T1555::[Pupy] can use Lazagne for harvesting credentials.",
        "T1557.001::[Pupy] can sniff plaintext network credentials and use NBNS Spoofing to poison name services.",
        "T1560.001::[Pupy] can compress data with Zip before sending it over C2.",
        "T1569.002::[Pupy] uses [PsExec] to execute a payload or commands on a remote host.",
        "T1573.002::[Pupy]'s default encryption for its C2 communication channel is SSL, but it also has transport options for RSA and AES."
      ]
    },
    "description": "[Pupy](https://attack.mitre.org/software/S0192) is an open source, cross-platform (Windows, Linux, OSX, Android) remote administration and post-exploitation tool. (Citation: GitHub Pupy) It is written in Python and can be generated as a payload in several different ways (Windows exe, Python file, PowerShell oneliner/file, Linux elf, APK, Rubber Ducky, etc.). (Citation: GitHub Pupy) [Pupy](https://attack.mitre.org/software/S0192) is publicly available on GitHub. (Citation: GitHub Pupy)"
  }
]
