[
  {
    "id": "intrusion-set--44102191-3a31-45f8-acbe-34bdb441d5ad",
    "name": "rocke",
    "aliases": "rocke",
    "group_id": "G0106",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 0,
        "items": []
      },
      "tools": {
        "count": 0,
        "items": []
      },
      "techniques": {
        "count": 36,
        "items": [
          "T1014",
          "T1018",
          "T1021.004",
          "T1027",
          "T1027.002",
          "T1027.004",
          "T1036.005",
          "T1037",
          "T1046",
          "T1053.003",
          "T1055.002",
          "T1057",
          "T1059.004",
          "T1059.006",
          "T1070.002",
          "T1070.004",
          "T1070.006",
          "T1071",
          "T1071.001",
          "T1082",
          "T1102",
          "T1102.001",
          "T1105",
          "T1140",
          "T1190",
          "T1222.002",
          "T1496",
          "T1518.001",
          "T1543.002",
          "T1547.001",
          "T1552.004",
          "T1562.001",
          "T1562.004",
          "T1564.001",
          "T1571",
          "T1574.006"
        ]
      },
      "tactics": {
        "count": 10,
        "items": [
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "impact",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation"
        ]
      },
      "procedures": [
        "T1014::[Rocke] has modified /etc/ld.so.preload to hook libc functions in order to hide the installed dropper and mining software in process lists.",
        "T1018::[Rocke] has looked for IP addresses in the known_hosts file on the infected system and attempted to SSH into them.",
        "T1021.004::[Rocke] has spread its coinminer via SSH.",
        "T1027.002::[Rocke]'s miner has created UPX-packed files in the Windows Start Menu Folder.",
        "T1027.004::[Rocke] has compiled malware, delivered to victims as .c files, with the GNU Compiler Collection (GCC).",
        "T1027::[Rocke] has modified UPX headers after packing files to break unpackers.",
        "T1036.005::[Rocke] has used shell scripts which download mining executables and saves them with the filename \"java\".",
        "T1037::[Rocke] has installed an \"init.d\" startup script to maintain persistence.",
        "T1046::[Rocke] conducted scanning for exposed TCP port 7001 as well as SSH and Redis servers.",
        "T1053.003::[Rocke] installed a cron job that downloaded and executed files from the C2.",
        "T1055.002::[Rocke]'s miner, \"TermsHost.exe\", evaded defenses by injecting itself into Windows processes, including Notepad.exe.",
        "T1057::[Rocke] can detect a running process's PID on the infected machine.",
        "T1059.004::[Rocke] used shell scripts to run commands which would obtain persistence and execute the cryptocurrency mining malware.",
        "T1059.006::[Rocke] has used Python-based malware to install and spread their coinminer.",
        "T1070.002::[Rocke] has cleared log files within the /var/log/ folder.",
        "T1070.004::[Rocke] has deleted files on infected machines.",
        "T1070.006::[Rocke] has changed the time stamp of certain files.",
        "T1071.001::[Rocke] has executed wget and curl commands to Pastebin over the HTTPS protocol.",
        "T1071::[Rocke] issued wget requests from infected systems to the C2.",
        "T1082::[Rocke] has used uname -m to collect the name and information about the infected system's kernel.",
        "T1102.001::[Rocke] has used Pastebin to check the version of beaconing malware and redirect to another Pastebin hosting updated malware.",
        "T1102::[Rocke] has used Pastebin, Gitee, and GitLab for Command and Control.",
        "T1105::[Rocke] used malware to download additional malicious files to the target system.",
        "T1140::[Rocke] has extracted tar.gz files after downloading them from a C2 server.",
        "T1190::[Rocke] exploited Apache Struts, Oracle WebLogic (CVE-2017-10271), and Adobe ColdFusion (CVE-2017-3066) vulnerabilities to deliver malware.",
        "T1222.002::[Rocke] has changed file permissions of files so they could not be modified.",
        "T1496::[Rocke] has distributed cryptomining malware.",
        "T1518.001::[Rocke] used scripts which detected and uninstalled antivirus software.",
        "T1543.002::[Rocke] has installed a systemd service script to maintain persistence.",
        "T1547.001::[Rocke]'s miner has created UPX-packed files in the Windows Start Menu Folder.",
        "T1552.004::[Rocke] has used SSH private keys on the infected machine to spread its coinminer throughout a network.",
        "T1562.001::[Rocke] used scripts which detected and uninstalled antivirus software.",
        "T1562.004::[Rocke] used scripts which killed processes and added firewall rules to block traffic related to other cryptominers.",
        "T1564.001::[Rocke] downloaded a file \"libprocesshider\", which could hide files on the target system.",
        "T1571::[Rocke]'s miner connects to a C2 server using port 51640.",
        "T1574.006::[Rocke] has modified /etc/ld.so.preload to hook libc functions in order to hide the installed dropper and mining software in process lists."
      ]
    },
    "description": "[Rocke](https://attack.mitre.org/groups/G0106) is an alleged Chinese-speaking adversary whose primary objective appeared to be cryptojacking, or stealing victim system resources for the purposes of mining cryptocurrency. The name [Rocke](https://attack.mitre.org/groups/G0106) comes from the email address \"rocke@live.cn\" used to create the wallet which held collected cryptocurrency. Researchers have detected overlaps between [Rocke](https://attack.mitre.org/groups/G0106) and the Iron Cybercrime Group, though this attribution has not been confirmed.(Citation: Talos Rocke August 2018)"
  }
]
