[
  {
    "id": "intrusion-set--0ec2f388-bf0f-4b5c-97b1-fc736d26c25f",
    "name": "kimsuky",
    "aliases": "kimsuky|stolen-pencil|thallium|black-banshee|velvet-chollima",
    "group_id": "G0094",
    "is_revoked": false,
    "profile": {
      "malware": {
        "count": 6,
        "items": [
          "appleseed",
          "babyshark",
          "brave-prince",
          "gold-dragon",
          "kgh_spy",
          "nokki"
        ]
      },
      "tools": {
        "count": 4,
        "items": [
          "cspy-downloader",
          "mimikatz",
          "psexec",
          "schtasks"
        ]
      },
      "techniques": {
        "count": 89,
        "items": [
          "T1003.001",
          "T1005",
          "T1007",
          "T1012",
          "T1016",
          "T1021.001",
          "T1027",
          "T1027.002",
          "T1036",
          "T1036.004",
          "T1036.005",
          "T1040",
          "T1041",
          "T1053.005",
          "T1055",
          "T1055.012",
          "T1056.001",
          "T1057",
          "T1059.001",
          "T1059.003",
          "T1059.005",
          "T1059.006",
          "T1059.007",
          "T1070.004",
          "T1070.006",
          "T1071.001",
          "T1071.002",
          "T1071.003",
          "T1074.001",
          "T1078.003",
          "T1082",
          "T1083",
          "T1098",
          "T1102.002",
          "T1105",
          "T1111",
          "T1112",
          "T1114.002",
          "T1114.003",
          "T1133",
          "T1136.001",
          "T1140",
          "T1176",
          "T1190",
          "T1204.001",
          "T1204.002",
          "T1218.005",
          "T1218.010",
          "T1218.011",
          "T1219",
          "T1505.003",
          "T1518.001",
          "T1534",
          "T1543.003",
          "T1546.001",
          "T1547.001",
          "T1550.002",
          "T1552.001",
          "T1553.002",
          "T1555.003",
          "T1557",
          "T1560.001",
          "T1560.003",
          "T1562.001",
          "T1562.004",
          "T1564.002",
          "T1564.003",
          "T1566.001",
          "T1566.002",
          "T1567.002",
          "T1583.001",
          "T1583.004",
          "T1583.006",
          "T1584.001",
          "T1585.001",
          "T1585.002",
          "T1586.002",
          "T1587",
          "T1587.001",
          "T1588.002",
          "T1588.005",
          "T1589.002",
          "T1589.003",
          "T1591",
          "T1593.001",
          "T1593.002",
          "T1594",
          "T1598.003",
          "T1608.001"
        ]
      },
      "tactics": {
        "count": 13,
        "items": [
          "collection",
          "command-and-control",
          "credential-access",
          "defense-evasion",
          "discovery",
          "execution",
          "exfiltration",
          "initial-access",
          "lateral-movement",
          "persistence",
          "privilege-escalation",
          "reconnaissance",
          "resource-development"
        ]
      },
      "procedures": [
        "T1003.001::[Kimsuky] has gathered credentials using [Mimikatz] and ProcDump.",
        "T1005::[Kimsuky] has collected Office, PDF, and HWP documents from its victims.",
        "T1007::[Kimsuky] has used an instrumentor script to gather the names of all services running on a victim's system.",
        "T1012::[Kimsuky] has obtained specific Registry keys and values on a compromised host.",
        "T1016::[Kimsuky] has used `ipconfig/all` to gather network configuration information.",
        "T1021.001::[Kimsuky] has used RDP for direct remote point-and-click access.",
        "T1027.002::[Kimsuky] has packed malware with UPX.",
        "T1027::[Kimsuky] has obfuscated binary strings including the use of XOR encryption and Base64 encoding.",
        "T1036.004::[Kimsuky] has disguised services to appear as benign software or related to operating system functions.",
        "T1036.005::[Kimsuky] has renamed malware to legitimate names such as ESTCommon.dll or patch.dll.",
        "T1036::[Kimsuky] has disguised its C2 addresses as the websites of shopping malls, governments, universities, and others.",
        "T1040::[Kimsuky] has used the Nirsoft SniffPass network sniffer to obtain passwords sent over non-secure protocols.",
        "T1041::[Kimsuky] has exfiltrated data over its C2 channel.",
        "T1053.005::[Kimsuky] has downloaded additional malware with scheduled tasks.",
        "T1055.012::[Kimsuky] has used a file injector DLL to spawn a benign process on the victim's system and inject the malicious payload into it via process hollowing.",
        "T1055::[Kimsuky] has used Win7Elevate to inject malicious code into explorer.exe.",
        "T1056.001::[Kimsuky] has used a PowerShell-based keylogger as well as a tool called MECHANICAL to log keystrokes.",
        "T1057::[Kimsuky] can gather a list of all processes running on a victim's machine.",
        "T1059.001::[Kimsuky] has executed a variety of PowerShell scripts.",
        "T1059.003::[Kimsuky] has executed Windows commands by using `cmd` and running batch scripts.",
        "T1059.005::[Kimsuky] has used Visual Basic to download malicious payloads.",
        "T1059.006::[Kimsuky] has used a macOS Python implant to gather data as well as MailFetcher.py code to automatically collect email data.",
        "T1059.007::[Kimsuky] has used JScript for logging and downloading additional tools.",
        "T1070.004::[Kimsuky] has deleted the exfiltrated data on disk after transmission. [Kimsuky] has also used an instrumentor script to terminate browser processes running on an infected system and then delete the cookie files on disk.",
        "T1070.006::[Kimsuky] has manipulated timestamps for creation or compilation dates to defeat anti-forensics.",
        "T1071.001::[Kimsuky]  has used HTTP GET and POST requests for C2.",
        "T1071.002::[Kimsuky] has used FTP to download additional malware to the target machine.",
        "T1071.003::[Kimsuky] has used e-mail to send exfiltrated data to C2 servers.",
        "T1074.001::[Kimsuky] has staged collected data files under C:\\Program Files\\Common Files\\System\\Ole DB\\.",
        "T1078.003::[Kimsuky] has used a tool called GREASE to add a Windows admin account in order to allow them continued access via RDP.",
        "T1082::[Kimsuky] has enumerated drives, OS type, OS version, and other information using a script or the \"systeminfo\" command.",
        "T1083::[Kimsuky] has the ability to enumerate all files and directories on an infected system.",
        "T1098::[Kimsuky] has added accounts to specific groups with net localgroup.",
        "T1102.002::[Kimsuky] has used Blogspot pages for C2.",
        "T1105::[Kimsuky] has downloaded additional scripts, tools, and malware onto victim systems.",
        "T1111::[Kimsuky] has used a proprietary tool to intercept one time passwords required for two-factor authentication.",
        "T1112::[Kimsuky] has modified Registry settings for default file associations to enable all macros and for persistence.",
        "T1114.002::[Kimsuky] has used tools such as the MailFetch mail crawler to collect victim emails (excluding spam) from online services via IMAP.",
        "T1114.003::[Kimsuky] has set auto-forward rules on victim's e-mail accounts.",
        "T1133::[Kimsuky] has used RDP to establish persistence.",
        "T1136.001::[Kimsuky] has created accounts with net user.",
        "T1140::[Kimsuky] has decoded malicious VBScripts using Base64.",
        "T1176::[Kimsuky] has used Google Chrome browser extensions to infect victims and to steal passwords and cookies.",
        "T1190::[Kimsuky] has exploited various vulnerabilities for initial access, including Microsoft Exchange vulnerability CVE-2020-0688.",
        "T1204.001::[Kimsuky] has lured victims into clicking malicious links.",
        "T1204.002::[Kimsuky] has used attempted to lure victims into opening malicious e-mail attachments.",
        "T1218.005::[Kimsuky] has used mshta.exe to run malicious scripts on the system.",
        "T1218.010::[Kimsuky] has executed malware with regsvr32s.",
        "T1218.011::[Kimsuky] has used `rundll32.exe` to execute malicious scripts and malware on a victim's network.",
        "T1219::[Kimsuky] has used a modified TeamViewer client as a command and control channel.",
        "T1505.003::[Kimsuky] has used modified versions of open source PHP web shells to maintain access, often adding \"Dinosaur\" references within the code.",
        "T1518.001::[Kimsuky] has checked for the presence of antivirus software with powershell Get-CimInstance -Namespace root/securityCenter2 – classname antivirusproduct.",
        "T1534::[Kimsuky] has sent internal spearphishing emails for lateral movement after stealing victim information.",
        "T1543.003::[Kimsuky] has created new services for persistence.",
        "T1546.001::[Kimsuky] has a HWP document stealer module which changes the default program association in the registry to open HWP documents.",
        "T1547.001::[Kimsuky] has placed scripts in the startup folder for persistence and modified the `HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce` Registry key.",
        "T1550.002::[Kimsuky] has used pass the hash for authentication to remote access software used in C2.",
        "T1552.001::[Kimsuky] has used tools that are capable of obtaining credentials from saved mail.",
        "T1553.002::[Kimsuky] has signed files with the name EGIS CO,. Ltd..",
        "T1555.003::[Kimsuky] has used browser extensions including Google Chrome to steal passwords and cookies from browsers. [Kimsuky] has also used Nirsoft's WebBrowserPassView tool to dump the passwords obtained from victims.",
        "T1557::[Kimsuky] has used modified versions of PHProxy to examine web traffic between the victim and the accessed website.",
        "T1560.001::[Kimsuky] has used QuickZip to archive stolen files before exfiltration.",
        "T1560.003::[Kimsuky] has used RC4 encryption before exfil.",
        "T1562.001::[Kimsuky] has been observed turning off Windows Security Center and can hide the AV software window from the view of the infected user.",
        "T1562.004::[Kimsuky] has been observed disabling the system firewall.",
        "T1564.002::[Kimsuky] has run reg add ‘HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\SpecialAccounts\\UserList’ /v to hide a newly created user.",
        "T1564.003::[Kimsuky] has used an information gathering module that will hide an AV software window from the victim.",
        "T1566.001::[Kimsuky] has used emails containing Word, Excel and/or HWP (Hangul Word Processor) documents in their spearphishing campaigns.",
        "T1566.002::[Kimsuky] has sent spearphishing emails containing a link to a document that contained malicious macros or took the victim to an actor-controlled domain.",
        "T1567.002::[Kimsuky] has exfiltrated stolen files and data to actor-controlled Blogspot accounts.",
        "T1583.001::[Kimsuky] has registered domains to spoof targeted organizations and trusted third parties.",
        "T1583.004::[Kimsuky] has purchased hosting servers with virtual currency and prepaid cards.",
        "T1583.006::[Kimsuky] has hosted content used for targeting efforts via web services such as Blogspot.",
        "T1584.001::[Kimsuky] has compromised legitimate sites and used them to distribute malware.",
        "T1585.001::[Kimsuky] has created social media accounts to monitor news and security trends as well as potential targets.",
        "T1585.002::[Kimsuky] has created email accounts for phishing operations.",
        "T1586.002::[Kimsuky] has compromised email accounts to send spearphishing e-mails.",
        "T1587.001::[Kimsuky] has developed its own unique malware such as MailFetch.py for use in operations.",
        "T1587::[Kimsuky] created and used a mailing toolkit to use in spearphishing attacks.",
        "T1588.002::[Kimsuky] has obtained and used tools such as Nirsoft WebBrowserPassVIew, [Mimikatz], and [PsExec].",
        "T1588.005::[Kimsuky] has obtained exploit code for various CVEs.",
        "T1589.002::[Kimsuky] has collected valid email addresses that were subsequently used in spearphishing campaigns.",
        "T1589.003::[Kimsuky] has collected victim employee name information.",
        "T1591::[Kimsuky] has collected victim organization information including but not limited to organization hierarchy, functions, press releases, and others.",
        "T1593.001::[Kimsuky] has used Twitter to monitor potential victims and to prepare targeted phishing e-mails.",
        "T1593.002::[Kimsuky] has searched for vulnerabilities, tools, and geopolitical trends on Google to target victims.",
        "T1594::[Kimsuky] has searched for information on the target company's website.",
        "T1598.003::[Kimsuky] has used links in e-mail to steal account information.",
        "T1608.001::[Kimsuky] has used Blogspot to host malicious content such as beacons, file exfiltrators, and implants."
      ]
    },
    "description": "[Kimsuky](https://attack.mitre.org/groups/G0094) is a North Korea-based cyber espionage group that has been active since at least 2012. The group initially focused on targeting South Korean government entities, think tanks, and individuals identified as experts in various fields, and expanded its operations to include the United States, Russia, Europe, and the UN. [Kimsuky](https://attack.mitre.org/groups/G0094) has focused its intelligence collection activities on foreign policy and national security issues related to the Korean peninsula, nuclear policy, and sanctions.(Citation: EST Kimsuky April 2019)(Citation: BRI Kimsuky April 2019)(Citation: Cybereason Kimsuky November 2020)(Citation: Malwarebytes Kimsuky June 2021)(Citation: CISA AA20-301A Kimsuky)\n\n[Kimsuky](https://attack.mitre.org/groups/G0094) was assessed to be responsible for the 2014 Korea Hydro & Nuclear Power Co. compromise; other notable campaigns include Operation STOLEN PENCIL (2018), Operation Kabar Cobra (2019), and Operation Smoke Screen (2019).(Citation: Netscout Stolen Pencil Dec 2018)(Citation: EST Kimsuky SmokeScreen April 2019)(Citation: AhnLab Kimsuky Kabar Cobra Feb 2019)\n\nNorth Korean group definitions are known to have significant overlap, and some security researchers report all North Korean state-sponsored cyber activity under the name [Lazarus Group](https://attack.mitre.org/groups/G0032) instead of tracking clusters or subgroups."
  }
]
